Alark8/RL78_Framework/inc/rl78_d1a_head.h
/*
** #######################################################################################################
**     Compilers:           ARM Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          GNU C Compiler - CodeSourcery Sourcery G++
**                          IAR ANSI C/C++ Compiler for ARM
**
**     Reference manual:    RL78UserGuide_Hardware.pdf
**     Version:             rev. 3.20, 01-07-2014
**
**     Abstract:
**         Renesas Peripheral Access Layer for G13 Family
**     
**	   Author: Alark Mishra
**
**     Copyright: NCVE. All Rights Reserved.
**
**     Revisions:
**     - rev. 1.0 (2013-07-30)
**         Initial version.
**     
**		This revision is a complete access layer of Renesas G13 microcontroller family.
** #######################################################################################################
*/


#ifndef RL78_D1A_HEAD_H
#define RL78_D1A_HEAD_H

#include "config.h"


/* --------------------------------------------------------------- Port Configuration Handlers ----------------------------------------------------------- */

/* Pull-up Resistor Option Register Definition */
typedef struct {
	volatile uint8_t PU0;
	volatile uint8_t PU1;
	volatile uint8_t BL1;
	volatile uint8_t PU3;
	volatile uint8_t PU4;
	volatile uint8_t PU5;
	volatile uint8_t PU6;
	volatile uint8_t PU7;
	volatile uint8_t PU8;
	volatile uint8_t PU9;
	volatile uint8_t PU10;
	volatile uint8_t PU11;
	volatile uint8_t PU12;
	volatile uint8_t PU13;
	volatile uint8_t PU14;
}PUR_Type, *PUR_MemMapPtr;


#define PULL_UP_RESISTOR_BASE												   															(0x0030)
#define PUR															 			 					  ((__near PUR_Type *)PULL_UP_RESISTOR_BASE)


/* Port Input Mode Register Definition */
typedef struct {
	volatile uint8_t PIM0;
	volatile uint8_t PIM1;
	volatile uint8_t BL1;
	volatile uint8_t PIM3;
	volatile uint8_t BL2;
	volatile uint8_t PIM5;
	volatile uint8_t PIM6;
	volatile uint8_t PIM7;
	volatile uint8_t BL3[3];
	volatile uint8_t PIM11;
	volatile uint8_t BL4;
	volatile uint8_t PIM13;
}PIM_Type, *PIM_MemMapPtr;


#define PORT_INPUT_MODE_REGISTER_BASE	   					    					   												    (0x0040)
#define PIM									 							 					  ((__near PIM_Type *)PORT_INPUT_MODE_REGISTER_BASE)



/* LCD Port Function Register Definition */
typedef struct {
	volatile uint8_t LCDPF0;
	volatile uint8_t LCDPF1;
	volatile uint8_t BL1;
	volatile uint8_t LCDPF3;
	volatile uint8_t LCDPF4;
	volatile uint8_t LCDPF5;
	volatile uint8_t BL2;
	volatile uint8_t LCDPF7;
	volatile uint8_t LCDPF8;
	volatile uint8_t LCDPF9;
	volatile uint8_t LCDPF10;
	volatile uint8_t LCDPF11;
	volatile uint8_t LCDPF12;
	volatile uint8_t LCDPF13;
}LCDPF_Type, *POM_MemMapPtr;


#define LCD_PORT_FUNCTION_REGISTER_BASE							                                   										(0x0050)
#define LCDPF									       									  ((__near LCDPF_Type *)LCD_PORT_FUNCTION_REGISTER_BASE)



/* Port Register Definition */
typedef struct {
	volatile uint8_t P0;
	volatile uint8_t P1;
	volatile uint8_t P2;
	volatile uint8_t P3;
	volatile uint8_t P4;
	volatile uint8_t P5;
	volatile uint8_t P6;
	volatile uint8_t P7;
	volatile uint8_t P8;
	volatile uint8_t P9;
	volatile uint8_t P10;
	volatile uint8_t P11;
	volatile uint8_t P12;
	volatile uint8_t P13;
	volatile uint8_t P14;
	volatile uint8_t P15;
} PORT_Type, *PORT_MemMapPtr;


#define PORT_REGISTER_BASE												   																(0xFF00)
#define PORT											  						   						((__near PORT_Type *)PORT_REGISTER_BASE)


/* Port Mode Register Definition */
typedef struct {
	volatile uint8_t PM0;
	volatile uint8_t PM1;
	volatile uint8_t PM2;
	volatile uint8_t PM3;
	volatile uint8_t PM4;
	volatile uint8_t PM5;
	volatile uint8_t PM6;
	volatile uint8_t PM7;
	volatile uint8_t PM8;
	volatile uint8_t PM9;
	volatile uint8_t PM10;
	volatile uint8_t PM11;
	volatile uint8_t PM12;
	volatile uint8_t PM13;
	volatile uint8_t PM14;
	volatile uint8_t PM15;
}PMR_Type, *PMR_MemMapPtr;


#define PORT_MODE_REGISTER_BASE												   															(0xFF20)
#define PMR										      						   						((__near PMR_Type *)PORT_MODE_REGISTER_BASE)



#define PERIPHERAL_ENABLE_REGISTER_0_BASE																								(0x00F0)
#define PER0																	 *((__near volatile uint8_t *)PERIPHERAL_ENABLE_REGISTER_0_BASE)

/* PER0 Bit Fields */
#define PER0_TAU0EN_SHIFT																													   0
#define PER0_TAU0EN_MASK																													0x01
#define PER0_TAU1EN_SHIFT																													   1
#define PER0_TAU1EN_MASK																													0x02
#define PER0_TAU2EN_SHIFT																													   2
#define PER0_TAU2EN_MASK																													0x04
#define PER0_SAU0EN_SHIFT																													   3
#define PER0_SAU0EN_MASK																													0x08
#define PER0_SAU1EN_SHIFT																													   4
#define PER0_SAU1EN_MASK																													0x10
#define PER0_LIN0EN_SHIFT																													   5
#define PER0_LIN0EN_MASK																													0x20
#define PER0_LIN1EN_SHIFT																													   6
#define PER0_LIN1EN_MASK																													0x40
#define PER0_RTCEN_SHIFT																													   7
#define PER0_RTCEN_MASK																														0x80




#define PERIPHERAL_ENABLE_REGISTER_1_BASE																								(0x00F1)
#define PER1																	 *((__near volatile uint8_t *)PERIPHERAL_ENABLE_REGISTER_1_BASE)

/* PER1 Bit Fields */
#define PER1_LBEN_SHIFT																														   3
#define PER1_LBEN_MASK																														0x08
#define PER1_SGEN_SHIFT																														   4
#define PER1_SGEN_MASK																														0x10
#define PER1_MTRCEN_SHIFT																													   5
#define PER1_MTRCEN_MASK																													0x20
#define PER1_ADCEN_SHIFT																													   7
#define PER1_ADCEN_MASK																														0x80




#define PORT_OUTPUT_MODE_REGISTER_BASE																									(0x006F)
#define POM																			*((__near volatile uint8_t *)PORT_OUTPUT_MODE_REGISTER_BASE)

#define GLOBAL_DIGITAL_INPUT_DISABLE_REGISTER_BASE									   													(0x007D)
#define GLOBAL_DIGITAL_INPUT_DISABLE_REGISTER			  				*((__near volatile uint8_t *)GLOBAL_DIGITAL_INPUT_DISABLE_REGISTER_BASE)

/* --------------------------------------------------------------- Port Configuration Handlers ----------------------------------------------------------- */












