Alark8/RL78_Framework/inc/rl78_d1a_head.h
/* ------------------------------------------------------------ Timer Configuration Handlers ------------------------------------------------------------ */

#define TIMER_DATA_REGISTER_00_BASE											   														   	(0xFF18)
#define TDR00										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_00_BASE)

#define TIMER_DATA_REGISTER_01_BASE											   														   	(0xFF1A)
#define TDR01										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_01_BASE)

#define TIMER_DATA_REGISTER_02_BASE											   														  	(0xFF64)
#define TDR02										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_02_BASE)

#define TIMER_DATA_REGISTER_03_BASE											   														   	(0xFF66)
#define TDR03										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_03_BASE)

#define TIMER_DATA_REGISTER_04_BASE											   														   	(0xFF68)
#define TDR04										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_04_BASE)

#define TIMER_DATA_REGISTER_05_BASE											   														   	(0xFF6A)
#define TDR05										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_05_BASE)

#define TIMER_DATA_REGISTER_06_BASE											   														   	(0xFF6C)
#define TDR06										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_06_BASE)

#define TIMER_DATA_REGISTER_07_BASE											   														   	(0xFF6E)
#define TDR07										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_07_BASE)

#define TIMER_DATA_REGISTER_10_BASE											   														   	(0xFF70)
#define TDR10										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_10_BASE)

#define TIMER_DATA_REGISTER_11_BASE											   														   	(0xFF72)
#define TDR11										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_11_BASE)

#define TIMER_DATA_REGISTER_12_BASE											   														   	(0xFF74)
#define TDR12										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_12_BASE)

#define TIMER_DATA_REGISTER_13_BASE											   														   	(0xFF76)
#define TDR13										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_13_BASE)

#define TIMER_DATA_REGISTER_14_BASE											   														   	(0xFF78)
#define TDR14										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_14_BASE)

#define TIMER_DATA_REGISTER_15_BASE											   														   	(0xFF7A)
#define TDR15										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_15_BASE)

#define TIMER_DATA_REGISTER_16_BASE											   														   	(0xFF7C)
#define TDR16										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_16_BASE)

#define TIMER_DATA_REGISTER_17_BASE											   														   	(0xFF7E)
#define TDR17										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_17_BASE)

#define TIMER_DATA_REGISTER_20_BASE											   														   	(0xFF90)
#define TDR20										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_20_BASE)

#define TIMER_DATA_REGISTER_21_BASE											   														   	(0xFF92)
#define TDR21										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_21_BASE)

#define TIMER_DATA_REGISTER_22_BASE											   														   	(0xFF94)
#define TDR22										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_22_BASE)

#define TIMER_DATA_REGISTER_23_BASE											   														   	(0xFF96)
#define TDR23										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_23_BASE)

#define TIMER_DATA_REGISTER_24_BASE											   														   	(0xFF98)
#define TDR24										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_24_BASE)

#define TIMER_DATA_REGISTER_25_BASE											   														   	(0xFF9A)
#define TDR25										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_25_BASE)

#define TIMER_DATA_REGISTER_26_BASE											   														   	(0xFF9C)
#define TDR26										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_26_BASE)

#define TIMER_DATA_REGISTER_27_BASE											   														   	(0xFF9E)
#define TDR27										  								  *((__near volatile uint16_t *)TIMER_DATA_REGISTER_27_BASE)



/* Timer Configuration Register Definition */
typedef struct {
	volatile uint8_t TNFEN;
	volatile uint8_t TNFSMP;
	volatile uint8_t TNFCS;
}NoiseFilter_Config_Type, *NoiseFilter_Config_MemMapPtr;


#define TIMER_CONFIG_0_REGISTER_BASE										 	   														(0x0060)
#define NOISE_FILTER_CONFIG0								    				((__near NoiseFilter_Config_Type *)TIMER_CONFIG_0_REGISTER_BASE)

#define TIMER_CONFIG_1_REGISTER_BASE										 	   													   	(0x0064)
#define NOISE_FILTER_CONFIG1								    				((__near NoiseFilter_Config_Type *)TIMER_CONFIG_1_REGISTER_BASE)

#define TIMER_CONFIG_2_REGISTER_BASE										 	   													   	(0x0068)
#define NOISE_FILTER_CONFIG2								    				((__near NoiseFilter_Config_Type *)TIMER_CONFIG_2_REGISTER_BASE)



/* TNFEN Bit Fields */
#define TIMER_TNFEN_TNFEN0_SHIFT																											   0
#define TIMER_TNFEN_TNFEN0_MASK																												0x01
#define TIMER_TNFEN_TNFEN1_SHIFT																											   1
#define TIMER_TNFEN_TNFEN1_MASK																												0x02
#define TIMER_TNFEN_TNFEN2_SHIFT																											   2
#define TIMER_TNFEN_TNFEN2_MASK																												0x04
#define TIMER_TNFEN_TNFEN3_SHIFT																											   3
#define TIMER_TNFEN_TNFEN3_MASK																												0x08
#define TIMER_TNFEN_TNFEN4_SHIFT																											   4
#define TIMER_TNFEN_TNFEN4_MASK																												0x10
#define TIMER_TNFEN_TNFEN5_SHIFT																											   5
#define TIMER_TNFEN_TNFEN5_MASK																												0x20
#define TIMER_TNFEN_TNFEN6_SHIFT																											   6
#define TIMER_TNFEN_TNFEN6_MASK																												0x40
#define TIMER_TNFEN_TNFEN7_SHIFT																											   7
#define TIMER_TNFEN_TNFEN7_MASK																												0x80



/* TNFSMP Bit Fields */
#define TIMER_TNFSMP_TNFSMP00_SHIFT																											   0
#define TIMER_TNFSMP_TNFSMP00_MASK																											0x0F
#define TIMER_TNFSMP_TNFSMP00_VALUE(x)					   (((uint8_t)(((uint8_t)(x))<<TIMER_TNFSMP_TNFSMP00_SHIFT))&TIMER_TNFSMP_TNFSMP00_MASK)
#define TIMER_TNFSMP_TNFSMP10_SHIFT																											   4
#define TIMER_TNFSMP_TNFSMP10_MASK																											0xF0
#define TIMER_TNFSMP_TNFSMP10_VALUE(x)					   (((uint8_t)(((uint8_t)(x))<<TIMER_TNFSMP_TNFSMP10_SHIFT))&TIMER_TNFSMP_TNFSMP10_MASK)



/* TNFCS Bit Fields */
#define TIMER_TNFCS_TNFCS0_SHIFT																											   0
#define TIMER_TNFCS_TNFCS0_MASK																												0x01
#define TIMER_TNFCS_TNFCS1_SHIFT																											   1
#define TIMER_TNFCS_TNFCS1_MASK																												0x02
#define TIMER_TNFCS_TNFCS2_SHIFT																											   2
#define TIMER_TNFCS_TNFCS2_MASK																												0x04
#define TIMER_TNFCS_TNFCS3_SHIFT																											   3
#define TIMER_TNFCS_TNFCS3_MASK																												0x08
#define TIMER_TNFCS_TNFCS4_SHIFT																											   4
#define TIMER_TNFCS_TNFCS4_MASK																												0x10
#define TIMER_TNFCS_TNFCS5_SHIFT																											   5
#define TIMER_TNFCS_TNFCS5_MASK																												0x20
#define TIMER_TNFCS_TNFCS6_SHIFT																											   6
#define TIMER_TNFCS_TNFCS6_MASK																												0x40
#define TIMER_TNFCS_TNFCS7_SHIFT																											   7
#define TIMER_TNFCS_TNFCS7_MASK																												0x80





/* Timer Information Register Definition */
typedef struct {
	volatile uint16_t TE;
	volatile uint16_t TS;
	volatile uint16_t TT;
	volatile uint16_t TPS;
	volatile uint16_t TO;
	volatile uint16_t TOE;
	volatile uint16_t TOL;
	volatile uint16_t TOM;
}TIMER_Type, *TIMER_MemMapPtr;


#define TIMER0_REGISTER_BASE												   														   	(0x01B0)
#define TIMER0										       											 ((__near TIMER_Type *)TIMER0_REGISTER_BASE)

#define TIMER1_REGISTER_BASE												   														   	(0x01F0)
#define TIMER1										       											 ((__near TIMER_Type *)TIMER1_REGISTER_BASE)

#define TIMER2_REGISTER_BASE												   														   	(0x0230)
#define TIMER2										       											 ((__near TIMER_Type *)TIMER2_REGISTER_BASE)


/* TE Bit Fields */
#define TIMER_TE_TE0_SHIFT																													   0
#define TIMER_TE_TE0_MASK																												  0x0001
#define TIMER_TE_TE1_SHIFT																													   1
#define TIMER_TE_TE1_MASK																												  0x0002
#define TIMER_TE_TE2_SHIFT																													   2
#define TIMER_TE_TE2_MASK																												  0x0004
#define TIMER_TE_TE3_SHIFT																													   3
#define TIMER_TE_TE3_MASK																												  0x0008
#define TIMER_TE_TE4_SHIFT																													   4
#define TIMER_TE_TE4_MASK																												  0x0010
#define TIMER_TE_TE5_SHIFT																													   5
#define TIMER_TE_TE5_MASK																												  0x0020
#define TIMER_TE_TE6_SHIFT																													   6
#define TIMER_TE_TE6_MASK																												  0x0040
#define TIMER_TE_TE7_SHIFT																													   7
#define TIMER_TE_TE7_MASK																												  0x0080


