Alark8/RL78_Framework/inc/rl78_d1a_head.h
/* TS Bit Fields */
#define TIMER_TS_TS0_SHIFT																													   0
#define TIMER_TS_TS0_MASK																												  0x0001
#define TIMER_TS_TS1_SHIFT																													   1
#define TIMER_TS_TS1_MASK																												  0x0002
#define TIMER_TS_TS2_SHIFT																													   2
#define TIMER_TS_TS2_MASK																												  0x0004
#define TIMER_TS_TS3_SHIFT																													   3
#define TIMER_TS_TS3_MASK																												  0x0008
#define TIMER_TS_TS4_SHIFT																													   4
#define TIMER_TS_TS4_MASK																												  0x0010
#define TIMER_TS_TS5_SHIFT																													   5
#define TIMER_TS_TS5_MASK																												  0x0020
#define TIMER_TS_TS6_SHIFT																													   6
#define TIMER_TS_TS6_MASK																												  0x0040
#define TIMER_TS_TS7_SHIFT																													   7
#define TIMER_TS_TS7_MASK																												  0x0080


/* TT Bit Fields */
#define TIMER_TT_TT0_SHIFT																													   0
#define TIMER_TT_TT0_MASK																												  0x0001
#define TIMER_TT_TT1_SHIFT																													   1
#define TIMER_TT_TT1_MASK																												  0x0002
#define TIMER_TT_TT2_SHIFT																													   2
#define TIMER_TT_TT2_MASK																												  0x0004
#define TIMER_TT_TT3_SHIFT																													   3
#define TIMER_TT_TT3_MASK																												  0x0008
#define TIMER_TT_TT4_SHIFT																													   4
#define TIMER_TT_TT4_MASK																												  0x0010
#define TIMER_TT_TT5_SHIFT																													   5
#define TIMER_TT_TT5_MASK																												  0x0020
#define TIMER_TT_TT6_SHIFT																													   6
#define TIMER_TT_TT6_MASK																												  0x0040
#define TIMER_TT_TT7_SHIFT																													   7
#define TIMER_TT_TT7_MASK																												  0x0080


/* TPS Bit Fields */
#define TIMER_TPS_M00_SHIFT																													   0
#define TIMER_TPS_M00_MASK																												  0x000F
#define TIMER_TPS_M00_VALUE(x)											 (((uint16_t)(((uint16_t)(x))<<TIMER_TPS_M00_SHIFT))&TIMER_TPS_M00_MASK)
#define TIMER_TPS_M10_SHIFT																													   4
#define TIMER_TPS_M10_MASK																												  0x00F0
#define TIMER_TPS_M10_VALUE(x)											 (((uint16_t)(((uint16_t)(x))<<TIMER_TPS_M10_SHIFT))&TIMER_TPS_M10_MASK)
#define TIMER_TPS_M20_SHIFT																													   8
#define TIMER_TPS_M20_MASK																												  0x0F00
#define TIMER_TPS_M20_VALUE(x)											 (((uint16_t)(((uint16_t)(x))<<TIMER_TPS_M20_SHIFT))&TIMER_TPS_M20_MASK)
#define TIMER_TPS_M30_SHIFT																													  12
#define TIMER_TPS_M30_MASK																												  0xF000
#define TIMER_TPS_M30_VALUE(x)											 (((uint16_t)(((uint16_t)(x))<<TIMER_TPS_M30_SHIFT))&TIMER_TPS_M30_MASK)


/* TO Bit Fields */
#define TIMER_TO_TO0_SHIFT																													   0
#define TIMER_TO_TO0_MASK																												  0x0001
#define TIMER_TO_TO1_SHIFT																													   1
#define TIMER_TO_TO1_MASK																												  0x0002
#define TIMER_TO_TO2_SHIFT																													   2
#define TIMER_TO_TO2_MASK																												  0x0004
#define TIMER_TO_TO3_SHIFT																													   3
#define TIMER_TO_TO3_MASK																												  0x0008
#define TIMER_TO_TO4_SHIFT																													   4
#define TIMER_TO_TO4_MASK																												  0x0010
#define TIMER_TO_TO5_SHIFT																													   5
#define TIMER_TO_TO5_MASK																												  0x0020
#define TIMER_TO_TO6_SHIFT																													   6
#define TIMER_TO_TO6_MASK																												  0x0040
#define TIMER_TO_TO7_SHIFT																													   7
#define TIMER_TO_TO7_MASK																												  0x0080


/* TOE Bit Fields */
#define TIMER_TOE_TOE0_SHIFT																												   0
#define TIMER_TOE_TOE0_MASK																												  0x0001
#define TIMER_TOE_TOE1_SHIFT																												   1
#define TIMER_TOE_TOE1_MASK																												  0x0002
#define TIMER_TOE_TOE2_SHIFT																												   2
#define TIMER_TOE_TOE2_MASK																												  0x0004
#define TIMER_TOE_TOE3_SHIFT																												   3
#define TIMER_TOE_TOE3_MASK																												  0x0008
#define TIMER_TOE_TOE4_SHIFT																												   4
#define TIMER_TOE_TOE4_MASK																												  0x0010
#define TIMER_TOE_TOE5_SHIFT																												   5
#define TIMER_TOE_TOE5_MASK																												  0x0020
#define TIMER_TOE_TOE6_SHIFT																												   6
#define TIMER_TOE_TOE6_MASK																												  0x0040
#define TIMER_TOE_TOE7_SHIFT																												   7
#define TIMER_TOE_TOE7_MASK																												  0x0080


/* TOL Bit Fields */
#define TIMER_TOL_TOL0_SHIFT																												   0
#define TIMER_TOL_TOL0_MASK																												  0x0001
#define TIMER_TOL_TOL1_SHIFT																												   1
#define TIMER_TOL_TOL1_MASK																												  0x0002
#define TIMER_TOL_TOL2_SHIFT																												   2
#define TIMER_TOL_TOL2_MASK																												  0x0004
#define TIMER_TOL_TOL3_SHIFT																												   3
#define TIMER_TOL_TOL3_MASK																												  0x0008
#define TIMER_TOL_TOL4_SHIFT																												   4
#define TIMER_TOL_TOL4_MASK																												  0x0010
#define TIMER_TOL_TOL5_SHIFT																												   5
#define TIMER_TOL_TOL5_MASK																												  0x0020
#define TIMER_TOL_TOL6_SHIFT																												   6
#define TIMER_TOL_TOL6_MASK																												  0x0040
#define TIMER_TOL_TOL7_SHIFT																												   7
#define TIMER_TOL_TOL7_MASK																												  0x0080


