Alark8/RL78_Framework/inc/rl78_d1a_head.h
/* TOM Bit Fields */
#define TIMER_TOM_TOM0_SHIFT																												   0
#define TIMER_TOM_TOM0_MASK																												  0x0001
#define TIMER_TOM_TOM1_SHIFT																												   1
#define TIMER_TOM_TOM1_MASK																												  0x0002
#define TIMER_TOM_TOM2_SHIFT																												   2
#define TIMER_TOM_TOM2_MASK																												  0x0004
#define TIMER_TOM_TOM3_SHIFT																												   3
#define TIMER_TOM_TOM3_MASK																												  0x0008
#define TIMER_TOM_TOM4_SHIFT																												   4
#define TIMER_TOM_TOM4_MASK																												  0x0010
#define TIMER_TOM_TOM5_SHIFT																												   5
#define TIMER_TOM_TOM5_MASK																												  0x0020
#define TIMER_TOM_TOM6_SHIFT																												   6
#define TIMER_TOM_TOM6_MASK																												  0x0040
#define TIMER_TOM_TOM7_SHIFT																												   7
#define TIMER_TOM_TOM7_MASK																												  0x0080




#define TIMER_COUNTER_REGISTER_00_BASE											   													   	(0x0180)
#define TCR00									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_00_BASE)

#define TIMER_COUNTER_REGISTER_01_BASE											   													   	(0x0182)
#define TCR01									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_01_BASE)

#define TIMER_COUNTER_REGISTER_02_BASE											   													   	(0x0184)
#define TCR02									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_02_BASE)

#define TIMER_COUNTER_REGISTER_03_BASE										           												   	(0x0186)
#define TCR03									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_03_BASE)

#define TIMER_COUNTER_REGISTER_04_BASE											   													   	(0x0188)
#define TCR04									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_04_BASE)

#define TIMER_COUNTER_REGISTER_05_BASE											   													   	(0x018A)
#define TCR05									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_05_BASE)

#define TIMER_COUNTER_REGISTER_06_BASE											   													   	(0x018C)
#define TCR06									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_06_BASE)

#define TIMER_COUNTER_REGISTER_07_BASE										           												   	(0x018E)
#define TCR07									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_07_BASE)

#define TIMER_COUNTER_REGISTER_10_BASE											   													   	(0x01C0)
#define TCR10									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_10_BASE)

#define TIMER_COUNTER_REGISTER_11_BASE											   													   	(0x01C2)
#define TCR11									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_11_BASE)

#define TIMER_COUNTER_REGISTER_12_BASE											   													   	(0x01C4)
#define TCR12									      							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_12_BASE)

#define TIMER_COUNTER_REGISTER_13_BASE											   													   	(0x01C6)
#define TCR13									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_13_BASE)

#define TIMER_COUNTER_REGISTER_14_BASE											   													   	(0x01C8)
#define TCR14									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_14_BASE)

#define TIMER_COUNTER_REGISTER_15_BASE											   													   	(0x01CA)
#define TCR15									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_15_BASE)

#define TIMER_COUNTER_REGISTER_16_BASE											   													   	(0x01CC)
#define TCR16									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_16_BASE)

#define TIMER_COUNTER_REGISTER_17_BASE											   													   	(0x01CE)
#define TCR17									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_17_BASE)

#define TIMER_COUNTER_REGISTER_20_BASE											   													   	(0x0200)
#define TCR20									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_20_BASE)

#define TIMER_COUNTER_REGISTER_21_BASE											   													   	(0x0202)
#define TCR21									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_21_BASE)

#define TIMER_COUNTER_REGISTER_22_BASE											   													   	(0x0204)
#define TCR22									      							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_22_BASE)

#define TIMER_COUNTER_REGISTER_23_BASE											   													   	(0x0206)
#define TCR23									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_23_BASE)

#define TIMER_COUNTER_REGISTER_24_BASE											   													   	(0x0208)
#define TCR24									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_24_BASE)

#define TIMER_COUNTER_REGISTER_25_BASE											   													   	(0x020A)
#define TCR25									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_25_BASE)

#define TIMER_COUNTER_REGISTER_26_BASE											   													   	(0x020C)
#define TCR26									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_26_BASE)

#define TIMER_COUNTER_REGISTER_27_BASE											   													   	(0x020E)
#define TCR27									       							   *((__near volatile uint16_t *)TIMER_COUNTER_REGISTER_27_BASE)





#define TIMER_MODE_REGISTER_00_BASE											   														    (0x0190)
#define TMR00										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_00_BASE)

#define TIMER_MODE_REGISTER_01_BASE											   														    (0x0192)
#define TMR01										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_01_BASE)

#define TIMER_MODE_REGISTER_02_BASE											   														    (0x0194)
#define TMR02										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_02_BASE)

#define TIMER_MODE_REGISTER_03_BASE											   														    (0x0196)
#define TMR03										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_03_BASE)

#define TIMER_MODE_REGISTER_04_BASE											   														    (0x0198)
#define TMR04										 								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_04_BASE)

#define TIMER_MODE_REGISTER_05_BASE											   														    (0x019A)
#define TMR05										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_05_BASE)

#define TIMER_MODE_REGISTER_06_BASE											   														    (0x019C)
#define TMR06										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_06_BASE)

#define TIMER_MODE_REGISTER_07_BASE											   														    (0x019E)
#define TMR07										   								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_07_BASE)

#define TIMER_MODE_REGISTER_10_BASE											  	 													    (0x01D0)
#define TMR10										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_10_BASE)

#define TIMER_MODE_REGISTER_11_BASE											   														    (0x01D2)
#define TMR11										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_11_BASE)

