Alark8/RL78_Framework/inc/rl78_d1a_head.h
#define TIMER_MODE_REGISTER_12_BASE											   														    (0x01D4)
#define TMR12										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_12_BASE)

#define TIMER_MODE_REGISTER_13_BASE											   														    (0x01D6)
#define TMR13										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_13_BASE)

#define TIMER_MODE_REGISTER_14_BASE											   														    (0x01D8)
#define TMR14										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_14_BASE)

#define TIMER_MODE_REGISTER_15_BASE											   														    (0x01DA)
#define TMR15										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_15_BASE)

#define TIMER_MODE_REGISTER_16_BASE											   														    (0x01DC)
#define TMR16										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_16_BASE)

#define TIMER_MODE_REGISTER_17_BASE											   														    (0x01DE)
#define TMR17										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_17_BASE)

#define TIMER_MODE_REGISTER_20_BASE											  	 													    (0x0210)
#define TMR20										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_20_BASE)

#define TIMER_MODE_REGISTER_21_BASE											   														    (0x0212)
#define TMR21										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_21_BASE)

#define TIMER_MODE_REGISTER_22_BASE											   														    (0x0214)
#define TMR22										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_22_BASE)

#define TIMER_MODE_REGISTER_23_BASE											   														    (0x0216)
#define TMR23										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_23_BASE)

#define TIMER_MODE_REGISTER_24_BASE											   														    (0x0218)
#define TMR24										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_24_BASE)

#define TIMER_MODE_REGISTER_25_BASE											   														    (0x021A)
#define TMR25										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_25_BASE)

#define TIMER_MODE_REGISTER_26_BASE											   														    (0x021C)
#define TMR26										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_26_BASE)

#define TIMER_MODE_REGISTER_27_BASE											   														    (0x021E)
#define TMR27										  								  *((__near volatile uint16_t *)TIMER_MODE_REGISTER_27_BASE)


/* TMR Bit Fields */
#define TIMER_TMR_MD_SHIFT																													   0
#define TIMER_TMR_MD_MASK																												  0x0001
#define TIMER_TMR_MD_VALUE(x)											   (((uint16_t)(((uint16_t)(x))<<TIMER_TMR_MD_SHIFT))&TIMER_TMR_MD_MASK)
#define TIMER_TMR_CIS_SHIFT																													   6
#define TIMER_TMR_CIS_MASK																												  0x00C0
#define TIMER_TMR_CIS_VALUE(x)											 (((uint16_t)(((uint16_t)(x))<<TIMER_TMR_CIS_SHIFT))&TIMER_TMR_CIS_MASK)
#define TIMER_TMR_STS_SHIFT																													   8
#define TIMER_TMR_STS_MASK																												  0x0700
#define TIMER_TMR_STS_VALUE(x)											 (((uint16_t)(((uint16_t)(x))<<TIMER_TMR_STS_SHIFT))&TIMER_TMR_STS_MASK)
#define TIMER_TMR_MASTER_SHIFT																												  11
#define TIMER_TMR_MASTER_MASK																											  0x0800
#define TIMER_TMR_CCS_SHIFT																													  12
#define TIMER_TMR_CCS_MASK																												  0x1000
#define TIMER_TMR_CKS_SHIFT																													  14
#define TIMER_TMR_CKS_MASK																												  0xC000
#define TIMER_TMR_CKS_VALUE(x)											 (((uint16_t)(((uint16_t)(x))<<TIMER_TMR_CKS_SHIFT))&TIMER_TMR_CKS_MASK)




#define TIMER_STATUS_REGISTER_00_BASE											   													   	(0x01A0)
#define TSR00																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_00_BASE)

#define TIMER_STATUS_REGISTER_01_BASE											   													   	(0x01A2)
#define TSR01																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_01_BASE)

#define TIMER_STATUS_REGISTER_02_BASE											   													   	(0x01A4)
#define TSR02																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_02_BASE)

#define TIMER_STATUS_REGISTER_03_BASE											   													   	(0x01A6)
#define TSR03																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_03_BASE)

#define TIMER_STATUS_REGISTER_04_BASE											   													   	(0x01A8)
#define TSR04																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_04_BASE)

#define TIMER_STATUS_REGISTER_05_BASE											   													   	(0x01AA)
#define TSR05																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_05_BASE)

#define TIMER_STATUS_REGISTER_06_BASE											   													   	(0x01AC)
#define TSR06																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_06_BASE)

#define TIMER_STATUS_REGISTER_07_BASE											   													   	(0x01AE)
#define TSR07																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_07_BASE)

#define TIMER_STATUS_REGISTER_10_BASE											   													   	(0x01E0)
#define TSR10																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_10_BASE)

#define TIMER_STATUS_REGISTER_11_BASE											   													   	(0x01E2)
#define TSR11																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_11_BASE)

#define TIMER_STATUS_REGISTER_12_BASE											   													   	(0x01E4)
#define TSR12																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_12_BASE)

#define TIMER_STATUS_REGISTER_13_BASE											   													   	(0x01E6)
#define TSR13																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_13_BASE)

#define TIMER_STATUS_REGISTER_14_BASE											   													   	(0x01E8)
#define TSR14																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_14_BASE)

#define TIMER_STATUS_REGISTER_15_BASE											   													   	(0x01EA)
#define TSR15																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_15_BASE)

#define TIMER_STATUS_REGISTER_16_BASE											   													   	(0x01EC)
#define TSR16																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_16_BASE)

#define TIMER_STATUS_REGISTER_17_BASE											   													   	(0x01EE)
#define TSR17																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_17_BASE)

#define TIMER_STATUS_REGISTER_20_BASE											   													   	(0x0220)
#define TSR20																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_20_BASE)

