Alark8/RL78_Framework/inc/rl78_d1a_head.h
#define TIMER_STATUS_REGISTER_21_BASE											   													   	(0x0222)
#define TSR21																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_21_BASE)

#define TIMER_STATUS_REGISTER_22_BASE											   													   	(0x0224)
#define TSR22																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_22_BASE)

#define TIMER_STATUS_REGISTER_23_BASE											   													   	(0x0226)
#define TSR23																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_23_BASE)

#define TIMER_STATUS_REGISTER_24_BASE											   													   	(0x0228)
#define TSR24																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_24_BASE)

#define TIMER_STATUS_REGISTER_25_BASE											   													   	(0x022A)
#define TSR25																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_25_BASE)

#define TIMER_STATUS_REGISTER_26_BASE											   													   	(0x022C)
#define TSR26																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_26_BASE)

#define TIMER_STATUS_REGISTER_27_BASE											   													   	(0x022E)
#define TSR27																		*((__near volatile uint16_t *)TIMER_STATUS_REGISTER_27_BASE)


/* TSR Bit Fields */
#define TIMER_TSR_OVF_SHIFT																													   0
#define TIMER_TSR_OVF_MASK																												  0x0001






#define TIMER_INPUT_SELECT_REGISTER_00_BASE																							   	(0x0070)
#define TIS00																   *((__near volatile uint8_t *)TIMER_INPUT_SELECT_REGISTER_00_BASE)

#define TIMER_INPUT_SELECT_REGISTER_01_BASE																							   	(0x0071)
#define TIS01																   *((__near volatile uint8_t *)TIMER_INPUT_SELECT_REGISTER_01_BASE)

#define TIMER_INPUT_SELECT_REGISTER_10_BASE																							   	(0x0072)
#define TIS10																   *((__near volatile uint8_t *)TIMER_INPUT_SELECT_REGISTER_10_BASE)

#define TIMER_INPUT_SELECT_REGISTER_11_BASE																							   	(0x0073)
#define TIS11																   *((__near volatile uint8_t *)TIMER_INPUT_SELECT_REGISTER_11_BASE)

#define TIMER_INPUT_SELECT_REGISTER_20_BASE																							   	(0x0074)
#define TIS20																   *((__near volatile uint8_t *)TIMER_INPUT_SELECT_REGISTER_20_BASE)

#define TIMER_INPUT_SELECT_REGISTER_21_BASE																							   	(0x0075)
#define TIS21																   *((__near volatile uint8_t *)TIMER_INPUT_SELECT_REGISTER_21_BASE)


/* TIS Bit Fields */
#define TIMER_TIS_TISm00_SHIFT																												   0
#define TIMER_TIS_TISm00_MASK																												0x03
#define TIMER_TIS_TISm00_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TIS_TISm00_SHIFT))&TIMER_TIS_TISm00_MASK)
#define TIMER_TIS_TISm10_SHIFT																												   2
#define TIMER_TIS_TISm10_MASK																												0x0C
#define TIMER_TIS_TISm10_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TIS_TISm10_SHIFT))&TIMER_TIS_TISm10_MASK)
#define TIMER_TIS_TISm20_SHIFT																												   4
#define TIMER_TIS_TISm20_MASK																												0x30
#define TIMER_TIS_TISm20_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TIS_TISm20_SHIFT))&TIMER_TIS_TISm20_MASK)
#define TIMER_TIS_TISm30_SHIFT																												   6
#define TIMER_TIS_TISm30_MASK																												0xC0
#define TIMER_TIS_TISm30_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TIS_TISm30_SHIFT))&TIMER_TIS_TISm30_MASK)
#define TIMER_TIS_TISm40_SHIFT																												   0
#define TIMER_TIS_TISm40_MASK																												0x03
#define TIMER_TIS_TISm40_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TIS_TISm40_SHIFT))&TIMER_TIS_TISm40_MASK)
#define TIMER_TIS_TISm50_SHIFT																												   2
#define TIMER_TIS_TISm50_MASK																												0x0C
#define TIMER_TIS_TISm50_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TIS_TISm50_SHIFT))&TIMER_TIS_TISm50_MASK)
#define TIMER_TIS_TISm60_SHIFT																												   4
#define TIMER_TIS_TISm60_MASK																												0x30
#define TIMER_TIS_TISm60_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TIS_TISm60_SHIFT))&TIMER_TIS_TISm60_MASK)
#define TIMER_TIS_TISm70_SHIFT																												   6
#define TIMER_TIS_TISm70_MASK																												0xC0
#define TIMER_TIS_TISm70_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TIS_TISm70_SHIFT))&TIMER_TIS_TISm70_MASK)





#define TIMER_OUTPUT_SELECT_REGISTER_00_BASE																						   	(0x0076)
#define TOS00																  *((__near volatile uint8_t *)TIMER_OUTPUT_SELECT_REGISTER_00_BASE)

#define TIMER_OUTPUT_SELECT_REGISTER_01_BASE																						   	(0x0077)
#define TOS01																  *((__near volatile uint8_t *)TIMER_OUTPUT_SELECT_REGISTER_01_BASE)

#define TIMER_OUTPUT_SELECT_REGISTER_10_BASE																						   	(0x0079)
#define TOS10																  *((__near volatile uint8_t *)TIMER_OUTPUT_SELECT_REGISTER_10_BASE)

#define TIMER_OUTPUT_SELECT_REGISTER_11_BASE																						   	(0x007A)
#define TOS11																  *((__near volatile uint8_t *)TIMER_OUTPUT_SELECT_REGISTER_11_BASE)

#define TIMER_OUTPUT_SELECT_REGISTER_20_BASE																						   	(0x007B)
#define TOS20																  *((__near volatile uint8_t *)TIMER_OUTPUT_SELECT_REGISTER_20_BASE)

#define TIMER_OUTPUT_SELECT_REGISTER_21_BASE																						   	(0x007C)
#define TOS21																  *((__near volatile uint8_t *)TIMER_OUTPUT_SELECT_REGISTER_21_BASE)


/* TOS Bit Fields */
#define TIMER_TOS_TOSm00_SHIFT																												   0
#define TIMER_TOS_TOSm00_MASK																												0x03
#define TIMER_TOS_TOSm00_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TOS_TOSm00_SHIFT))&TIMER_TOS_TOSm00_MASK)
#define TIMER_TOS_TOSm10_SHIFT																												   2
#define TIMER_TOS_TOSm10_MASK																												0x0C
#define TIMER_TOS_TOSm10_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TOS_TOSm10_SHIFT))&TIMER_TOS_TOSm10_MASK)
#define TIMER_TOS_TOSm20_SHIFT																												   4
#define TIMER_TOS_TOSm20_MASK																												0x30
#define TIMER_TOS_TOSm20_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TOS_TOSm20_SHIFT))&TIMER_TOS_TOSm20_MASK)
#define TIMER_TOS_TOSm30_SHIFT																												   6
#define TIMER_TOS_TOSm30_MASK																												0xC0
#define TIMER_TOS_TOSm30_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TOS_TOSm30_SHIFT))&TIMER_TOS_TOSm30_MASK)
#define TIMER_TOS_TOSm40_SHIFT																												   0
#define TIMER_TOS_TOSm40_MASK																												0x03
#define TIMER_TOS_TOSm40_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TOS_TOSm40_SHIFT))&TIMER_TOS_TOSm40_MASK)
#define TIMER_TOS_TOSm50_SHIFT																												   2
#define TIMER_TOS_TOSm50_MASK																												0x0C
#define TIMER_TOS_TOSm50_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TOS_TOSm50_SHIFT))&TIMER_TOS_TOSm50_MASK)
#define TIMER_TOS_TOSm60_SHIFT																												   4
#define TIMER_TOS_TOSm60_MASK																												0x30
#define TIMER_TOS_TOSm60_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TOS_TOSm60_SHIFT))&TIMER_TOS_TOSm60_MASK)
#define TIMER_TOS_TOSm70_SHIFT																												   6
#define TIMER_TOS_TOSm70_MASK																												0xC0
#define TIMER_TOS_TOSm70_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<TIMER_TOS_TOSm70_SHIFT))&TIMER_TOS_TOSm70_MASK)



#define INTERVAL_TIMER_CTRL_REGISTER_BASE					 					   													   	(0xFF50)
#define ITMC											   						*((__near volatile uint16_t *)INTERVAL_TIMER_CTRL_REGISTER_BASE)

