Alark8/RL78_Framework/inc/rl78_d1a_head.h
/* ITMC Bit Fields */
#define TIMER_ITMC_ITMCMP_SHIFT																												   0
#define TIMER_ITMC_ITMCMP_MASK																											  0x7FFF
#define TIMER_ITMC_ITMCMP_VALUE(x)								 (((uint16_t)(((uint16_t)(x))<<TIMER_ITMC_ITMCMP_SHIFT))&TIMER_ITMC_ITMCMP_MASK)
#define TIMER_ITMC_RINTE_SHIFT																												  15
#define TIMER_ITMC_RINTE_MASK																											  0x8000

/* ------------------------------------------------------------ Timer Configuration Handlers ------------------------------------------------------------ */














/* -------------------------------------------------------------- ADC Configuration Handlers ------------------------------------------------------------ */


typedef struct
{
    unsigned char no0:1;
    unsigned char no1:1;
    unsigned char no2:1;
    unsigned char no3:1;
    unsigned char no4:1;
    unsigned char no5:1;
    unsigned char no6:1;
    unsigned char no7:1;
} __bitf_T;


/* ADC Config Register Definition */
typedef struct {
	volatile uint8_t ADM0;
	volatile uint8_t ADS;
	volatile uint8_t ADM1;
}ADC0_Config_Type, *ADC0_Config_MemMapPtr;


#define ADC0_CONFIGURATION_REGISTER_BASE										   													   	(0xFF30)
#define ADC0_CONFIG							     								   ((__near ADC0_Config_Type *)ADC0_CONFIGURATION_REGISTER_BASE)


/* ADM0 Bit Fields */
#define ADC_ADM0_ADCE_SHIFT																													   0
#define ADC_ADM0_ADCE_MASK																													0x01
#define ADC_ADM0_DV_SHIFT																													   1
#define ADC_ADM0_DV_MASK																													0x06
#define ADC_ADM0_DV_VALUE(x)												   (((uint8_t)(((uint8_t)(x))<<ADC_ADM0_DV_SHIFT))&ADC_ADM0_DV_MASK)
#define ADC_ADM0_FR_SHIFT																													   3
#define ADC_ADM0_FR_MASK																													0x38
#define ADC_ADM0_FR_VALUE(x)												   (((uint8_t)(((uint8_t)(x))<<ADC_ADM0_FR_SHIFT))&ADC_ADM0_FR_MASK)
#define ADC_ADM0_ADMD_SHIFT																													   6
#define ADC_ADM0_ADMD_MASK																													0x40
#define ADC_ADM0_ADCS_SHIFT																													   7
#define ADC_ADM0_ADCS_MASK																													0x80


/* ADS Bit Fields */
#define ADC_ADS_SHIFT																														   0
#define ADC_ADS_MASK																														0x0F
#define ADC_ADS_VALUE(x)															   (((uint8_t)(((uint8_t)(x))<<ADC_ADS_SHIFT))&ADC_ADS_MASK)


/* ADM1 Bit Fields */
#define ADC_ADM1_ADTRS_SHIFT																												   0
#define ADC_ADM1_ADTRS_MASK																													0x03
#define ADC_ADM1_ADTRS_VALUE(x)											 (((uint8_t)(((uint8_t)(x))<<ADC_ADM1_ADTRS_SHIFT))&ADC_ADM1_ADTRS_MASK)
#define ADC_ADM1_ADSCM_SHIFT																												   5
#define ADC_ADM1_ADSCM_MASK																													0x20
#define ADC_ADM1_ADTMD_SHIFT																												   6
#define ADC_ADM1_ADTMD_MASK																													0xC0
#define ADC_ADM1_ADTMD_VALUE(x)											 (((uint8_t)(((uint8_t)(x))<<ADC_ADM1_ADTMD_SHIFT))&ADC_ADM1_ADTMD_MASK)



#define ADCS         																				 (((volatile __near __bitf_T *)0xFF30)->no7)





/* ADC Config Register Definition */
typedef struct {
	volatile uint8_t ADM2;
	volatile uint8_t ADUL;
	volatile uint8_t ADLL;
	volatile uint8_t ADTES;
}ADC1_Config_Type, *ADC1_Config_MemMapPtr;


#define ADC1_CONFIGURATION_REGISTER_BASE										   													   	(0x0010)
#define ADC1_CONFIG							     								   ((__near ADC1_Config_Type *)ADC1_CONFIGURATION_REGISTER_BASE)


/* ADM2 Bit Fields */
#define ADC_ADM2_ADTYP_SHIFT																												   0
#define ADC_ADM2_ADTYP_MASK																													0x01
#define ADC_ADM2_AWC_SHIFT																													   2
#define ADC_ADM2_AWC_MASK																													0x04
#define ADC_ADM2_ADRCK_SHIFT																												   3
#define ADC_ADM2_ADRCK_MASK																													0x08
#define ADC_ADM2_ADREFM_SHIFT																												   5
#define ADC_ADM2_ADREFM_MASK																												0x20
#define ADC_ADM2_ADREFP_SHIFT																												   6
#define ADC_ADM2_ADREFP_MASK																												0xC0
#define ADC_ADM2_ADREFP_VALUE(x)									   (((uint8_t)(((uint8_t)(x))<<ADC_ADM2_ADREFP_SHIFT))&ADC_ADM2_ADREFP_MASK)


/* ADTES Bit Fields */
#define ADC_ADTES_SHIFT																														   0
#define ADC_ADTES_MASK																														0x07
#define ADC_ADTES_VALUE(x)														   (((uint8_t)(((uint8_t)(x))<<ADC_ADTES_SHIFT))&ADC_ADTES_MASK)




#define ADC_CONVERSION_RESULT_BASE											   														   	(0xFF1E)
#define ADCR							 									  		   *((__near volatile uint16_t *)ADC_CONVERSION_RESULT_BASE)

#define ADC_PORT_CONFIG_REGISTER_BASE											   													   	(0x006E)
#define ADPC										       							 *((__near volatile uint8_t *)ADC_PORT_CONFIG_REGISTER_BASE)


/* ADPC Bit Fields */
#define ADC_ADPC_MASK																														0x0F
#define ADC_ADPC_SHIFT																														   0
#define ADC_ADPC_VALUE(x)												   			 (((uint8_t)(((uint8_t)(x))<<ADC_ADPC_SHIFT))&ADC_ADPC_MASK)

/* -------------------------------------------------------------- ADC Configuration Handlers ------------------------------------------------------------ */








/* ------------------------------------------------------------- RTC Configuration Handlers ------------------------------------------------------------- */

/* RTC Register Definition */
typedef struct {
	volatile uint8_t SEC;
	volatile uint8_t MIN;
	volatile uint8_t HOUR;
	volatile uint8_t WEEK;
	volatile uint8_t DAY;
	volatile uint8_t MONTH;
	volatile uint8_t YEAR;
	volatile uint8_t SUBCUD;
	volatile uint8_t ALARMWM;
	volatile uint8_t ALARMWH;
	volatile uint8_t ALARMWW;
	volatile uint8_t RTCC0;
	volatile uint8_t RTCC1;
}RTC_Type, *RTC_MemMapPtr;


#define RTC_REGISTER_BASE												   															   	(0xFF52)
#define RTC											    												  ((__near RTC_Type *)RTC_REGISTER_BASE)


/* SUBCUD Bit Fields */
#define RTC_SUBCUD_F_SHIFT																													   0
#define RTC_SUBCUD_F_MASK																													0x7F
#define RTC_SUBCUD_F_VALUE(x)												 (((uint8_t)(((uint8_t)(x))<<RTC_SUBCUD_F_SHIFT))&RTC_SUBCUD_F_MASK)
#define RTC_SUBCUD_DEV_SHIFT																												   7
#define RTC_SUBCUD_DEV_MASK																													0x80


/* RTCC0 Bit Fields */
#define RTC_RTCC0_CT_SHIFT																													   0
#define RTC_RTCC0_CT_MASK																													0x07
#define RTC_RTCC0_CT_VALUE(x)												 (((uint8_t)(((uint8_t)(x))<<RTC_RTCC0_CT_SHIFT))&RTC_RTCC0_CT_MASK)
#define RTC_RTCC0_AMPM_SHIFT																												   3
#define RTC_RTCC0_AMPM_MASK																													0x08
#define RTC_RTCC0_RCLOE1_SHIFT																												   5
#define RTC_RTCC0_RCLOE1_MASK																												0x20
#define RTC_RTCC0_RTCE_SHIFT																												   7
#define RTC_RTCC0_RTCE_MASK																													0x80


/* RTCC1 Bit Fields */
#define RTC_RTCC1_RWAIT_SHIFT																												   0
#define RTC_RTCC1_RWAIT_MASK																												0x01
#define RTC_RTCC1_RWST_SHIFT																												   1
#define RTC_RTCC1_RWST_MASK																													0x02
#define RTC_RTCC1_RIFG_SHIFT																												   3
#define RTC_RTCC1_RIFG_MASK																													0x08
#define RTC_RTCC1_WAFG_SHIFT																												   4
#define RTC_RTCC1_WAFG_MASK																													0x10
#define RTC_RTCC1_WALIE_SHIFT																												   6
#define RTC_RTCC1_WALIE_MASK																												0x40
#define RTC_RTCC1_WALE_SHIFT																												   7
#define RTC_RTCC1_WALE_MASK																													0x80




#define RTC_CLOCK_SELECTION_REGISTER_BASE																							   	(0x00F9)
#define RTCCL																	 *((__near volatile uint8_t *)RTC_CLOCK_SELECTION_REGISTER_BASE)

/* RTCCL Bit Fields */
#define RTC_RTCCL_RTCCKS_SHIFT																												   0
#define RTC_RTCCL_RTCCKS_MASK																												0x03
#define RTC_RTCCL_RTCCKS_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<RTC_RTCCL_RTCCKS_SHIFT))&RTC_RTCCL_RTCCKS_MASK)
#define RTC_RTCCL_RTCCL6_SHIFT																												   6
#define RTC_RTCCL_RTCCL6_MASK																												0x40
#define RTC_RTCCL_RTCCL7_SHIFT																												   7
#define RTC_RTCCL_RTCCL7_MASK																												0x80





#define RTC_1HZ_PIN_SEL_REGISTER_BASE																								   	(0xFF36)
#define RTCSEL																		 *((__near volatile uint8_t *)RTC_1HZ_PIN_SEL_REGISTER_BASE)

/*RTCSEL Bit Fields */
#define RTCSEL_RTCTIS00_SHIFT																												   0
#define RTCSEL_RTCTIS00_MASK																												0x01
#define RTCSEL_RTCTIS01_SHIFT																												   1
#define RTCSEL_RTCTIS01_MASK																												0x02
#define RTCSEL_RTCTIS10_SHIFT																												   2
#define RTCSEL_RTCTIS10_MASK																												0x04
#define RTCSEL_RTCTIS11_SHIFT																												   3
#define RTCSEL_RTCTIS11_MASK																												0x08
#define RTCSEL_RTCOSEL_SHIFT																												   6
#define RTCSEL_RTCOSEL_MASK																													0xC0
#define RTCSEL_RTCOSEL_VALUE(x)											 (((uint8_t)(((uint8_t)(x))<<RTCSEL_RTCOSEL_SHIFT))&RTCSEL_RTCOSEL_MASK)




#define WATCH_ERROR_CORRECTION_REGISTER_BASE																						   	(0xFF34)
#define SUBCUDW																 *((__near volatile uint16_t *)WATCH_ERROR_CORRECTION_REGISTER_BASE)

/* SUBCUDW Bit Fields */
#define RTC_SUBCUDW_F_SHIFT																													   0
#define RTC_SUBCUDW_F_MASK																												  0x1FFF
#define RTC_SUBCUDW_F_VALUE(x)											   (((uint8_t)(((uint8_t)(x))<<RTC_SUBCUDW_F_SHIFT))&RTC_SUBCUDW_F_MASK)

/* ------------------------------------------------------------- RTC Configuration Handlers ------------------------------------------------------------- */














/* ----------------------------------------------------------- DMA Configuration Handlers ------------------------------------------------------------ */

