Alark8/RL78_Framework/inc/rl78_d1a_head.h
#define DMA_SFR_REGISTER_0_BASE												   														   	(0xFFB0)
#define DSA0										      								   *((__near volatile uint8_t *)DMA_SFR_REGISTER_0_BASE)

#define DMA_SFR_REGISTER_1_BASE												   														   	(0xFFB1)
#define DSA1										      								   *((__near volatile uint8_t *)DMA_SFR_REGISTER_1_BASE)

#define DMA_SFR_REGISTER_2_BASE												   														   	(0x0170)
#define DSA2										      								   *((__near volatile uint8_t *)DMA_SFR_REGISTER_2_BASE)

#define DMA_SFR_REGISTER_3_BASE												   														   	(0x0171)
#define DSA3										      								   *((__near volatile uint8_t *)DMA_SFR_REGISTER_3_BASE)



/* DMA RAM Register Definition */
typedef struct {
	union {
		volatile uint8_t DRA_L;
		volatile uint8_t DRA_H;
	}ACCESS_8bit;
	volatile uint16_t DRA;
}DMA_RAM_Type, *DMA_RAM_MemMapPtr;


#define DMA_RAM_REGISTER_0_BASE												   														   	(0xFFB2)
#define DRA0										  											((__near DMA_RAM_Type *)DMA_RAM_REGISTER_0_BASE)

#define DMA_RAM_REGISTER_1_BASE												   														   	(0xFFB4)
#define DRA1										  											((__near DMA_RAM_Type *)DMA_RAM_REGISTER_1_BASE)

#define DMA_RAM_REGISTER_2_BASE												   														  	(0x0172)
#define DRA2										  											((__near DMA_RAM_Type *)DMA_RAM_REGISTER_2_BASE)

#define DMA_RAM_REGISTER_3_BASE												   														  	(0x0174)
#define DRA3										  											((__near DMA_RAM_Type *)DMA_RAM_REGISTER_3_BASE)






#define DMA_BYTE_COUNT_REGISTER_0_BASE											   													   	(0xFFB6)
#define DBC0									    							   *((__near volatile uint16_t *)DMA_BYTE_COUNT_REGISTER_0_BASE)

#define DMA_BYTE_COUNT_REGISTER_1_BASE											   													   	(0xFFB8)
#define DBC1									    							   *((__near volatile uint16_t *)DMA_BYTE_COUNT_REGISTER_1_BASE)

#define DMA_BYTE_COUNT_REGISTER_2_BASE											   													   	(0x0176)
#define DBC2									    							   *((__near volatile uint16_t *)DMA_BYTE_COUNT_REGISTER_2_BASE)

#define DMA_BYTE_COUNT_REGISTER_3_BASE											   													   	(0x0178)
#define DBC3									    							   *((__near volatile uint16_t *)DMA_BYTE_COUNT_REGISTER_3_BASE)


/* DBC Bit Fields */
#define DMA_DBC_SHIFT																														   0
#define DMA_DBC_MASK																													  0x03FF
#define DMA_DBC_VALUE(x)															 (((uint16_t)(((uint16_t)(x))<<DMA_DBC_SHIFT))&DMA_DBC_MASK)





#define DMA_MODE_CONTROL_REGISTER_0_BASE										   													   	(0xFFBA)
#define DMC0									   								  *((__near volatile uint8_t *)DMA_MODE_CONTROL_REGISTER_0_BASE)

#define DMA_MODE_CONTROL_REGISTER_1_BASE										   													   	(0xFFBB)
#define DMC1									   								  *((__near volatile uint8_t *)DMA_MODE_CONTROL_REGISTER_1_BASE)

#define DMA_MODE_CONTROL_REGISTER_2_BASE										   													   	(0x017A)
#define DMC2									   								  *((__near volatile uint8_t *)DMA_MODE_CONTROL_REGISTER_2_BASE)

#define DMA_MODE_CONTROL_REGISTER_3_BASE										   													   	(0x017B)
#define DMC3									   								  *((__near volatile uint8_t *)DMA_MODE_CONTROL_REGISTER_3_BASE)


/* DMC Bit Fields */
#define DMA_DMC_IFC_SHIFT																													   0
#define DMA_DMC_IFC_MASK																													0x0F
#define DMA_DMC_IFC_VALUE(x)
#define DMA_DMC_DWAIT_SHIFT																													   4
#define DMA_DMC_DWAIT_MASK																													0x10
#define DMA_DMC_DS_SHIFT																													   5
#define DMA_DMC_DS_MASK																														0x20
#define DMA_DMC_DRS_SHIFT																													   6
#define DMA_DMC_DRS_MASK																													0x40
#define DMA_DMC_STG_SHIFT																													   7
#define DMA_DMC_STG_MASK																													0x80






#define DMA_OPER_CONTROL_REGISTER_0_BASE										   													   	(0xFFBC)
#define DRC0									   								  *((__near volatile uint8_t *)DMA_OPER_CONTROL_REGISTER_0_BASE)

#define DMA_OPER_CONTROL_REGISTER_1_BASE										   													   	(0xFFBD)
#define DRC1									   								  *((__near volatile uint8_t *)DMA_OPER_CONTROL_REGISTER_1_BASE)

#define DMA_OPER_CONTROL_REGISTER_2_BASE										   													   	(0x017C)
#define DRC2									   								  *((__near volatile uint8_t *)DMA_OPER_CONTROL_REGISTER_2_BASE)

#define DMA_OPER_CONTROL_REGISTER_3_BASE										   													   	(0x017D)
#define DRC3									   								  *((__near volatile uint8_t *)DMA_OPER_CONTROL_REGISTER_3_BASE)


/* DRC Bit Fields */
#define DMA_DRC_DST_SHIFT																													   0
#define DMA_DRC_DST_MASK																													0x01
#define DMA_DRC_DEN_SHIFT																													   7
#define DMA_DRC_DEN_MASK																													0x80





#define DMA_TRIGGER_SELECTION_REGISTER_BASE																							   	(0x001F)
#define DMATSEL																   *((__near volatile uint8_t *)DMA_TRIGGER_SELECTION_REGISTER_BASE)


/* DMATSEL Bit Fields */
#define DMA_DMATSEL_DMATSL01_SHIFT																											   0
#define DMA_DMATSEL_DMATSL01_MASK																											0x01
#define DMA_DMATSEL_DMATSL23_SHIFT																											   1
#define DMA_DMATSEL_DMATSL23_MASK																											0x02




#define DMA_ALL_CHANNEL_FORCE_WAIT_REGISTER_BASE																					   	(0x017F)
#define DWAITALL														  *((__near volatile uint8_t *)DMA_ALL_CHANNEL_FORCE_WAIT_REGISTER_BASE)


/* DWAITALL Bit Fields */
#define DMA_DWAITALL_SHIFT																													   0
#define DMA_DWAITALL_MASK																													0x01
#define DMA_DWAITALL_PRVARI_SHIFT																											   7
#define DMA_DWAITALL_PRVARI_MASK																											0x80

/* ----------------------------------------------------------- DMA Configuration Handlers ------------------------------------------------------------ */













/* ---------------------------------------------------------- Interrupt Configuration Handlers ------------------------------------------------------ */

/* Interrupt Request Flag Register Definition */
typedef union {
	union {
		volatile uint8_t IF_L;
		volatile uint8_t IF_H;
	}ACCESS_8bit;
	volatile uint16_t IF;
}IRF_Req_Type, *IRF_Req_MemMapPtr;


