Alark8/RL78_Framework/inc/rl78_d1a_head.h
#define INTERRUPT_REQ_FLAG_REGISTER_0_BASE										   													   	(0xFFE0)
#define IF0																			 ((__near IRF_Req_Type *)INTERRUPT_REQ_FLAG_REGISTER_0_BASE)


/* IF0 Bit Fields */
#define INT_IF0_WDTIIF_SHIFT																												   0
#define INT_IF0_WDTIIF_MASK																												  0x0001
#define INT_IF0_LVIIF_SHIFT																													   1
#define INT_IF0_LVIIF_MASK																												  0x0002
#define INT_IF0_PIF0_SHIFT																													   2
#define INT_IF0_PIF0_MASK																												  0x0004
#define INT_IF0_PIF1_SHIFT																													   3
#define INT_IF0_PIF1_MASK																												  0x0008
#define INT_IF0_PIF2_SHIFT																													   4
#define INT_IF0_PIF2_MASK																												  0x0010
#define INT_IF0_PIF3_SHIFT																													   5
#define INT_IF0_PIF3_MASK																												  0x0020
#define INT_IF0_PIF4_SHIFT																													   6
#define INT_IF0_PIF4_MASK																												  0x0040
#define INT_IF0_PIF5_SHIFT																													   7
#define INT_IF0_PIF5_MASK																												  0x0080
#define INT_IF0_CLMIF_SHIFT																													   8
#define INT_IF0_CLMIF_MASK																												  0x0100
#define INT_IF0_CSIIF0_SHIFT																												   9
#define INT_IF0_CSIIF0_MASK																												  0x0200
#define INT_IF0_CSIIF1_SHIFT																												  10
#define INT_IF0_CSIIF1_MASK																												  0x0400
#define INT_IF0_DMAIF0_SHIFT																												  11
#define INT_IF0_DMAIF0_MASK																												  0x0800
#define INT_IF0_DMAIF1_SHIFT																												  12
#define INT_IF0_DMAIF1_MASK																												  0x1000
#define INT_IF0_RTCIF_SHIFT																													  13
#define INT_IF0_RTCIF_MASK																												  0x2000
#define INT_IF0_ITIF_SHIFT																													  14
#define INT_IF0_ITIF_MASK																												  0x4000
#define INT_IF0_LTIF0_SHIFT																													  15
#define INT_IF0_LTIF0_MASK																												  0x8000





#define INTERRUPT_REQ_FLAG_REGISTER_1_BASE										   													   	(0xFFE2)
#define IF1																			 ((__near IRF_Req_Type *)INTERRUPT_REQ_FLAG_REGISTER_1_BASE)


/* IF1 Bit Fields */
#define INT_IF1_LRIF0_SHIFT																													   0
#define INT_IF1_LRIF0_MASK																												  0x0001
#define INT_IF1_LSIF0_SHIFT																													   1
#define INT_IF1_LSIF0_MASK																												  0x0002
#define INT_IF1_PIFLR0_SHIFT																												   2
#define INT_IF1_PIFLR0_MASK																												  0x0004
#define INT_IF1_SGIF_SHIFT																													   3
#define INT_IF1_SGIF_MASK																												  0x0008
#define INT_IF1_TMIF00_SHIFT																												   4
#define INT_IF1_TMIF00_MASK																												  0x0010
#define INT_IF1_TMIF01_SHIFT																												   5
#define INT_IF1_TMIF01_MASK																												  0x0020
#define INT_IF1_TMIF02_SHIFT																												   6
#define INT_IF1_TMIF02_MASK																												  0x0040
#define INT_IF1_TMIF03_SHIFT																												   7
#define INT_IF1_TMIF03_MASK																												  0x0080
#define INT_IF1_ADIF_SHIFT																												   	   8
#define INT_IF1_ADIF_MASK																												  0x0100
#define INT_IF1_LTIF1_SHIFT																												 	   9
#define INT_IF1_LTIF1_MASK																												  0x0200
#define INT_IF1_LRIF1_SHIFT																													  10
#define INT_IF1_LRIF1_MASK																												  0x0400
#define INT_IF1_LSIF1_SHIFT																													  11
#define INT_IF1_LSIF1_MASK																												  0x0800
#define INT_IF1_PIFLR1_SHIFT																												  12
#define INT_IF1_PIFLR1_MASK																												  0x1000
#define INT_IF1_CSIIF10_SHIFT																												  13
#define INT_IF1_CSIIF10_MASK																											  0x2000
#define INT_IF1_IICIF11_SHIFT																												  14
#define INT_IF1_IICIF11_MASK																											  0x4000
#define INT_IF1_TMIF04_SHIFT																												  15
#define INT_IF1_TMIF04_MASK																												  0x8000





#define INTERRUPT_REQ_FLAG_REGISTER_2_BASE										   													   	(0xFFD0)
#define IF2																			 ((__near IRF_Req_Type *)INTERRUPT_REQ_FLAG_REGISTER_2_BASE)


/* IF2 Bit Fields */
#define INT_IF2_TMIF05_SHIFT																												   0
#define INT_IF2_TMIF05_MASK																												  0x0001
#define INT_IF2_TMIF06_SHIFT																												   1
#define INT_IF2_TMIF06_MASK																												  0x0002
#define INT_IF2_TMIF07_SHIFT																												   2
#define INT_IF2_TMIF07_MASK																												  0x0004
#define INT_IF2_C1ERRIF_SHIFT																												   3
#define INT_IF2_C1ERRIF_MASK																											  0x0008
#define INT_IF2_C1WUPIF_SHIFT																												   4
#define INT_IF2_C1WUPIF_MASK																											  0x0010
#define INT_IF2_C0ERRIF_SHIFT																												   5
#define INT_IF2_C0ERRIF_MASK																											  0x0020
#define INT_IF2_C0WUPIF_SHIFT																												   6
#define INT_IF2_C0WUPIF_MASK																											  0x0040
#define INT_IF2_C0RECIF_SHIFT																												   7
#define INT_IF2_C0RECIF_MASK																											  0x0080
#define INT_IF2_C0TRXIF_SHIFT																												   8
#define INT_IF2_C0TRXIF_MASK																											  0x0100
#define INT_IF2_TMIF10_SHIFT																												   9
#define INT_IF2_TMIF10_MASK																											  	  0x0200
#define INT_IF2_TMIF11_SHIFT																												  10
#define INT_IF2_TMIF11_MASK																											  	  0x0400
#define INT_IF2_TMIF12_SHIFT																												  11
#define INT_IF2_TMIF12_MASK																											  	  0x0800
#define INT_IF2_TMIF13_SHIFT																												  12
#define INT_IF2_TMIF13_MASK																											  	  0x1000
#define INT_IF2_MDIF_SHIFT																												      13
#define INT_IF2_MDIF_MASK																											  	  0x2000
#define INT_IF2_C1RECIF_SHIFT																												  14
#define INT_IF2_C1RECIF_MASK																											  0x4000
#define INT_IF2_FLIF_SHIFT																													  15
#define INT_IF2_FLIF_MASK																											  	  0x8000





#define INTERRUPT_REQ_FLAG_REGISTER_3_BASE										   													   	(0xFFD2)
#define IF3																			 ((__near IRF_Req_Type *)INTERRUPT_REQ_FLAG_REGISTER_3_BASE)


