Alark8/RL78_Framework/inc/rl78_d1a_head.h
/* IF3 Bit Fields */
#define INT_IF3_C1TRXIF_SHIFT																												   0
#define INT_IF3_C1TRXIF_MASK																											  0x0001
#define INT_IF3_TMIF14_SHIFT																												   1
#define INT_IF3_TMIF14_MASK																												  0x0002
#define INT_IF3_TMIF15_SHIFT																												   2
#define INT_IF3_TMIF15_MASK																												  0x0004
#define INT_IF3_TMIF16_SHIFT																												   3
#define INT_IF3_TMIF16_MASK																												  0x0008
#define INT_IF3_TMIF17_SHIFT																												   4
#define INT_IF3_TMIF17_MASK																												  0x0010
#define INT_IF3_TMIF20_SHIFT																												   5
#define INT_IF3_TMIF20_MASK																												  0x0020
#define INT_IF3_TMIF21_SHIFT																												   6
#define INT_IF3_TMIF21_MASK																												  0x0040
#define INT_IF3_TMIF22_SHIFT																												   7
#define INT_IF3_TMIF22_MASK																												  0x0080
#define INT_IF3_TMIF23_SHIFT																												   8
#define INT_IF3_TMIF23_MASK																												  0x0100
#define INT_IF3_TMIF24_SHIFT																												   9
#define INT_IF3_TMIF24_MASK																												  0x0200
#define INT_IF3_TMIF26_SHIFT																												  10
#define INT_IF3_TMIF26_MASK																												  0x0400
#define INT_IF3_DMAIF2_SHIFT																												  11
#define INT_IF3_DMAIF2_MASK																												  0x0800
#define INT_IF3_DMAIF3_SHIFT																												  12
#define INT_IF3_DMAIF3_MASK																												  0x1000







/* Interrupt Mask Flag Register Definition */
typedef union {
	union {
		volatile uint8_t MK_L;
		volatile uint8_t MK_H;
	}ACCESS_8bit;
	volatile uint16_t MK;
}IRF_Mask_Type, *IRF_Mask_MemMapPtr;


#define INTERRUPT_MASK_FLAG_REGISTER_0_BASE										  													   	(0xFFE4)
#define MK0								       									   ((__near IRF_Mask_Type *)INTERRUPT_MASK_FLAG_REGISTER_0_BASE)


/* MK0 Bit Fields */
#define INT_MK0_WDTIMK_SHIFT																												   0
#define INT_MK0_WDTIMK_MASK																												  0x0001
#define INT_MK0_LVIMK_SHIFT																													   1
#define INT_MK0_LVIMK_MASK																												  0x0002
#define INT_MK0_PMK0_SHIFT																													   2
#define INT_MK0_PMK0_MASK																												  0x0004
#define INT_MK0_PMK1_SHIFT																													   3
#define INT_MK0_PMK1_MASK																												  0x0008
#define INT_MK0_PMK2_SHIFT																													   4
#define INT_MK0_PMK2_MASK																												  0x0010
#define INT_MK0_PMK3_SHIFT																													   5
#define INT_MK0_PMK3_MASK																												  0x0020
#define INT_MK0_PMK4_SHIFT																													   6
#define INT_MK0_PMK4_MASK																												  0x0040
#define INT_MK0_PMK5_SHIFT																													   7
#define INT_MK0_PMK5_MASK																												  0x0080
#define INT_MK0_CLMMK_SHIFT																													   8
#define INT_MK0_CLMMK_MASK																												  0x0100
#define INT_MK0_CSIMK0_SHIFT																												   9
#define INT_MK0_CSIMK0_MASK																												  0x0200
#define INT_MK0_CSIMK1_SHIFT																												  10
#define INT_MK0_CSIMK1_MASK																												  0x0400
#define INT_MK0_DMAMK0_SHIFT																												  11
#define INT_MK0_DMAMK0_MASK																												  0x0800
#define INT_MK0_DMAMK1_SHIFT																												  12
#define INT_MK0_DMAMK1_MASK																												  0x1000
#define INT_MK0_RTCMK_SHIFT																													  13
#define INT_MK0_RTCMK_MASK																												  0x2000
#define INT_MK0_ITMK_SHIFT																													  14
#define INT_MK0_ITMK_MASK																												  0x4000
#define INT_MK0_LTMK0_SHIFT																													  15
#define INT_MK0_LTMK0_MASK																												  0x8000




#define INTERRUPT_MASK_FLAG_REGISTER_1_BASE										   													   	(0xFFE6)
#define MK1								       									   ((__near IRF_Mask_Type *)INTERRUPT_MASK_FLAG_REGISTER_1_BASE)


/* MK1 Bit Fields */
#define INT_MK1_LRMK0_SHIFT																													   0
#define INT_MK1_LRMK0_MASK																												  0x0001
#define INT_MK1_LSMK0_SHIFT																													   1
#define INT_MK1_LSMK0_MASK																												  0x0002
#define INT_MK1_PMKLR0_SHIFT																												   2
#define INT_MK1_PMKLR0_MASK																												  0x0004
#define INT_MK1_SGMK_SHIFT																													   3
#define INT_MK1_SGMK_MASK																												  0x0008
#define INT_MK1_TMMK00_SHIFT																												   4
#define INT_MK1_TMMK00_MASK																												  0x0010
#define INT_MK1_TMMK01_SHIFT																												   5
#define INT_MK1_TMMK01_MASK																												  0x0020
#define INT_MK1_TMMK02_SHIFT																												   6
#define INT_MK1_TMMK02_MASK																												  0x0040
#define INT_MK1_TMMK03_SHIFT																												   7
#define INT_MK1_TMMK03_MASK																												  0x0080
#define INT_MK1_ADMK_SHIFT																												   	   8
#define INT_MK1_ADMK_MASK																												  0x0100
#define INT_MK1_LTMK1_SHIFT																												 	   9
#define INT_MK1_LTMK1_MASK																												  0x0200
#define INT_MK1_LRMK1_SHIFT																													  10
#define INT_MK1_LRMK1_MASK																												  0x0400
#define INT_MK1_LSMK1_SHIFT																													  11
#define INT_MK1_LSMK1_MASK																												  0x0800
#define INT_MK1_PMKLR1_SHIFT																												  12
#define INT_MK1_PMKLR1_MASK																												  0x1000
#define INT_MK1_CSIMK10_SHIFT																												  13
#define INT_MK1_CSIMK10_MASK																											  0x2000
#define INT_MK1_IICMK11_SHIFT																												  14
#define INT_MK1_IICMK11_MASK																											  0x4000
#define INT_MK1_TMMK04_SHIFT																												  15
#define INT_MK1_TMMK04_MASK																												  0x8000






#define INTERRUPT_MASK_FLAG_REGISTER_2_BASE										   													   	(0xFFD4)
#define MK2								       									   ((__near IRF_Mask_Type *)INTERRUPT_MASK_FLAG_REGISTER_2_BASE)


/* MK2 Bit Fields */
#define INT_MK2_TMMK05_SHIFT																												   0
#define INT_MK2_TMMK05_MASK																												  0x0001
#define INT_MK2_TMMK06_SHIFT																												   1
#define INT_MK2_TMMK06_MASK																												  0x0002
#define INT_MK2_TMMK07_SHIFT																												   2
#define INT_MK2_TMMK07_MASK																												  0x0004
#define INT_MK2_C1ERRMK_SHIFT																												   3
#define INT_MK2_C1ERRMK_MASK																											  0x0008
#define INT_MK2_C1WUPMK_SHIFT																												   4
#define INT_MK2_C1WUPMK_MASK																											  0x0010
#define INT_MK2_C0ERRMK_SHIFT																												   5
#define INT_MK2_C0ERRMK_MASK																											  0x0020
#define INT_MK2_C0WUPMK_SHIFT																												   6
#define INT_MK2_C0WUPMK_MASK																											  0x0040
#define INT_MK2_C0RECMK_SHIFT																												   7
#define INT_MK2_C0RECMK_MASK																											  0x0080
#define INT_MK2_C0TRXMK_SHIFT																												   8
#define INT_MK2_C0TRXMK_MASK																											  0x0100
#define INT_MK2_TMMK10_SHIFT																												   9
#define INT_MK2_TMMK10_MASK																											  	  0x0200
#define INT_MK2_TMMK11_SHIFT																												  10
#define INT_MK2_TMMK11_MASK																											  	  0x0400
#define INT_MK2_TMMK12_SHIFT																												  11
#define INT_MK2_TMMK12_MASK																											  	  0x0800
#define INT_MK2_TMMK13_SHIFT																												  12
#define INT_MK2_TMMK13_MASK																											  	  0x1000
#define INT_MK2_MDMK_SHIFT																												      13
#define INT_MK2_MDMK_MASK																											  	  0x2000
#define INT_MK2_C1RECMK_SHIFT																												  14
#define INT_MK2_C1RECMK_MASK																											  0x4000
#define INT_MK2_FLMK_SHIFT																													  15
#define INT_MK2_FLMK_MASK																											  	  0x8000






#define INTERRUPT_MASK_FLAG_REGISTER_3_BASE										   													   	(0xFFD6)
#define MK3								       									   ((__near IRF_Mask_Type *)INTERRUPT_MASK_FLAG_REGISTER_3_BASE)


/* MK3 Bit Fields */
#define INT_MK3_C1TRXMK_SHIFT																												   0
#define INT_MK3_C1TRXMK_MASK																											  0x0001
#define INT_MK3_TMMK14_SHIFT																												   1
#define INT_MK3_TMMK14_MASK																												  0x0002
#define INT_MK3_TMMK15_SHIFT																												   2
#define INT_MK3_TMMK15_MASK																												  0x0004
#define INT_MK3_TMMK16_SHIFT																												   3
#define INT_MK3_TMMK16_MASK																												  0x0008
#define INT_MK3_TMMK17_SHIFT																												   4
#define INT_MK3_TMMK17_MASK																												  0x0010
#define INT_MK3_TMMK20_SHIFT																												   5
#define INT_MK3_TMMK20_MASK																												  0x0020
#define INT_MK3_TMMK21_SHIFT																												   6
#define INT_MK3_TMMK21_MASK																												  0x0040
#define INT_MK3_TMMK22_SHIFT																												   7
#define INT_MK3_TMMK22_MASK																												  0x0080
#define INT_MK3_TMMK23_SHIFT																												   8
#define INT_MK3_TMMK23_MASK																												  0x0100
#define INT_MK3_TMMK24_SHIFT																												   9
#define INT_MK3_TMMK24_MASK																												  0x0200
#define INT_MK3_TMMK26_SHIFT																												  10
#define INT_MK3_TMMK26_MASK																												  0x0400
#define INT_MK3_DMAMK2_SHIFT																												  11
#define INT_MK3_DMAMK2_MASK																												  0x0800
#define INT_MK3_DMAMK3_SHIFT																												  12
#define INT_MK3_DMAMK3_MASK																												  0x1000







/* External Interrupt Register 0 Definition */
typedef struct {
	volatile uint8_t EGP;
	volatile uint8_t EGN;
}EXT_Interrupt_Type, *EXT_Interrupt_MemMapPtr;


#define EXT_INTERRUPT_EDGE_ENABLE_REGISTER_0_BASE									   												   	(0xFF38)
#define EXT_INT0						  								((__near EXT_Interrupt_Type *)EXT_INTERRUPT_EDGE_ENABLE_REGISTER_0_BASE)

/* ---------------------------------------------------------- Interrupt Configuration Handlers ------------------------------------------------------ */













