Alark8/RL78_Framework/inc/rl78_d1a_head.h
/* ---------------------------------------------------------- Clock Configuration Handlers --------------------------------------------------------- */

/* Clock Registers Definition */
typedef struct{
	volatile uint8_t CMC;
	volatile uint8_t CSC;
	volatile uint8_t OSTC;
	volatile uint8_t OSTS;
	volatile uint8_t CKC;
	volatile uint8_t CKS0;
}CLK_Type, *CLK_MemMapPtr;


#define CLOCK_CONFIGURATION_REGISTER_BASE										   														(0xFFA0)
#define CLOCK									    									  ((__near CLK_Type *)CLOCK_CONFIGURATION_REGISTER_BASE)


/* CMC Bit Fields */
#define CLOCK_CMC_AMPH_SHIFT																												   0
#define CLOCK_CMC_AMPH_MASK																													0x01
#define CLOCK_CMC_AMPHS_SHIFT																												   1
#define CLOCK_CMC_AMPHS_MASK																												0x06
#define CLOCK_CMC_AMPHS_VALUE(x)									   (((uint8_t)(((uint8_t)(x))<<CLOCK_CMC_AMPHS_SHIFT))&CLOCK_CMC_AMPHS_MASK)
#define CLOCK_CMC_OSCSELS_SHIFT																												   4
#define CLOCK_CMC_OSCSELS_MASK																												0x10
#define CLOCK_CMC_OSCSEL_SHIFT																												   6
#define CLOCK_CMC_OSCSEL_MASK																												0x40
#define CLOCK_CMC_EXCLK_SHIFT																												   7
#define CLOCK_CMC_EXCLK_MASK																												0x80


/* CSC Bit Fields */
#define CLOCK_CSC_HIOSTOP_SHIFT																												   0
#define CLOCK_CSC_HIOSTOP_MASK																												0x01
#define CLOCK_CSC_XTSTOP_SHIFT																												   6
#define CLOCK_CSC_XTSTOP_MASK																												0x40
#define CLOCK_CSC_MSTOP_SHIFT																												   7
#define CLOCK_CSC_MSTOP_MASK																												0x80


/* OSTS Bit Fields */
#define CLOCK_OSTS_SHIFT																													   0
#define CLOCK_OSTS_MASK																														0x07
#define CLOCK_OSTS_VALUE(x)														 (((uint8_t)(((uint8_t)(x))<<CLOCK_OSTS_SHIFT))&CLOCK_OSTS_MASK)



/* CKC Bit Fields */
#define CLOCK_CKC_MCM0_SHIFT																												   4
#define CLOCK_CKC_MCM0_MASK																													0x10
#define CLOCK_CKC_MCS_SHIFT																													   5
#define CLOCK_CKC_MCS_MASK																													0x20
#define CLOCK_CKC_CSS_SHIFT																													   6
#define CLOCK_CKC_CSS_MASK																													0x40
#define CLOCK_CKC_CLS_SHIFT																													   7
#define CLOCK_CKC_CLS_MASK																													0x80


/* CKS0 Bit Fields */
#define CLOCK_CKS0_CCS_SHIFT																												   0
#define CLOCK_CKS0_CCS_MASK																													0x07
#define CLOCK_CKS0_CCS_VALUE(x)											 (((uint8_t)(((uint8_t)(x))<<CLOCK_CKS0_CCS_SHIFT))&CLOCK_CKS0_CCS_MASK)
#define CLOCK_CKS0_CSEL_SHIFT																												   3
#define CLOCK_CKS0_CSEL_MASK																												0x08
#define CLOCK_CKS0_PCLOE_SHIFT																												   7
#define CLOCK_CKS0_PCLOE_MASK																												0x80




#define HIGH_SPEED_OSC_TRIM_REGISTER_BASE										   													   	(0x00A0)
#define HIOTRM											   						 *((__near volatile uint8_t *)HIGH_SPEED_OSC_TRIM_REGISTER_BASE)


/* HIOTRM Bit Fields */
#define CLOCK_HIOTRM_SHIFT																													   0
#define CLOCK_HIOTRM_MASK																													0x3F
#define CLOCK_HIOTRM_VALUE(x)												 (((uint8_t)(((uint8_t)(x))<<CLOCK_HIOTRM_SHIFT))&CLOCK_HIOTRM_MASK)




#define OPERATION_SPEED_MODE_CTRL_REGISTER_BASE									           											   	(0x00F3)
#define OSMC				       										   *((__near volatile uint8_t *)OPERATION_SPEED_MODE_CTRL_REGISTER_BASE)

/* OSMC Bit Fields */
#define CLOCK_OSMC_WUTMMCK0_SHIFT																											   4
#define CLOCK_OSMC_WUTMMCK0_MASK																											0x10
#define CLOCK_OSMC_RTCLPC_SHIFT																												   7
#define CLOCK_OSMC_RTCLPC_MASK																												0x80





#define PERIPHERAL_CLOCK_SELECT_REGISTER_BASE																						   	(0x00F2)
#define PCKSEL																 *((__near volatile uint8_t *)PERIPHERAL_CLOCK_SELECT_REGISTER_BASE)

/* PCKSEL Bit Fields */
#define CLOCK_PCKSEL_SGCLKSEL_SHIFT																											   0
#define CLOCK_PCKSEL_SGCLKSEL_MASK																											0x01
#define CLOCK_PCKSEL_CANMCK0_SHIFT																											   3
#define CLOCK_PCKSEL_CANMCK0_MASK																											0x08
#define CLOCK_PCKSEL_CANMCKE0_SHIFT																											   4
#define CLOCK_PCKSEL_CANMCKE0_MASK																											0x10
#define CLOCK_PCKSEL_CANMCK1_SHIFT																											   5
#define CLOCK_PCKSEL_CANMCK1_MASK																											0x20
#define CLOCK_PCKSEL_CANMCKE1_SHIFT																											   6
#define CLOCK_PCKSEL_CANMCKE1_MASK																											0x40

/* ---------------------------------------------------------- Clock Configuration Handlers --------------------------------------------------------- */











/* ------------------------------------------------------------- Serial Control Registers --------------------------------------------------------- */

/* Serial Information Register Definition */
typedef struct {
	volatile uint16_t SE;
	volatile uint16_t SS;
	volatile uint16_t ST;
	volatile uint16_t SPS;
	volatile uint16_t SO;
	volatile uint16_t SOE;
	volatile uint16_t BL1[4];
	volatile uint16_t SOL;
} SER_Type, *SER_MemMapPtr;


#define SERIAL_CHANNEL_REGISTER_0_BASE											   													   	(0x0110)
#define SERIAL0																				 ((__near SER_Type *)SERIAL_CHANNEL_REGISTER_0_BASE)

#define SERIAL_CHANNEL_REGISTER_1_BASE											   													   	(0x0140)
#define SERIAL1																				 ((__near SER_Type *)SERIAL_CHANNEL_REGISTER_1_BASE)



/* SE Bit Fields */
#define SERIAL_SE_SHIFT																														   0
#define SERIAL_SE_MASK																													  0x0003
#define SERIAL_SE_VALUE(x)														 (((uint16_t)(((uint16_t)(x))<<SERIAL_SE_SHIFT))&SERIAL_SE_MASK)


/* SS Bit Fields */
#define SERIAL_SS_SHIFT																														   0
#define SERIAL_SS_MASK																													  0x0003
#define SERIAL_SS_VALUE(x)														 (((uint16_t)(((uint16_t)(x))<<SERIAL_SS_SHIFT))&SERIAL_SS_MASK)


/* ST Bit Fields */
#define SERIAL_ST_SHIFT																														   0
#define SERIAL_ST_MASK																													  0x0003
#define SERIAL_ST_VALUE(x)														 (((uint16_t)(((uint16_t)(x))<<SERIAL_ST_SHIFT))&SERIAL_ST_MASK)


/* SPS Bit Fields */
#define SERIAL_SPS_PRSm0_SHIFT																												   0
#define SERIAL_SPS_PRSm0_MASK																											  0x000F
#define SERIAL_SPS_PRSm0_VALUE(x)								   (((uint16_t)(((uint16_t)(x))<<SERIAL_SPS_PRSm0_SHIFT))&SERIAL_SPS_PRSm0_MASK)
#define SERIAL_SPS_PRSm1_SHIFT																												   4
#define SERIAL_SPS_PRSm1_MASK																											  0x00F0
#define SERIAL_SPS_PRSm1_VALUE(x)								   (((uint16_t)(((uint16_t)(x))<<SERIAL_SPS_PRSm1_SHIFT))&SERIAL_SPS_PRSm1_MASK)


/* SO Bit Fields */
#define SERIAL_SO_SHIFT																														   0
#define SERIAL_SO_MASK																													  0x0003
#define SERIAL_SO_VALUE(x)														 (((uint16_t)(((uint16_t)(x))<<SERIAL_SO_SHIFT))&SERIAL_SO_MASK)
#define SERIAL_CKO_SHIFT																													   8
#define SERIAL_CKO_MASK																													  0x0300
#define SERIAL_CKO_VALUE(x)													   (((uint16_t)(((uint16_t)(x))<<SERIAL_CKO_SHIFT))&SERIAL_CKO_MASK)


