Alark8/RL78_Framework/inc/rl78_d1a_head.h
/* SOE Bit Fields */
#define SERIAL_SOE_SHIFT																													   0
#define SERIAL_SOE_MASK																													  0x0003
#define SERIAL_SOE_VALUE(x)													   (((uint16_t)(((uint16_t)(x))<<SERIAL_SOE_SHIFT))&SERIAL_SOE_MASK)


/* SOL Bit Fields */
#define SERIAL_SOL_SHIFT																													   0
#define SERIAL_SOL_MASK																													  0x0001




/* Serial Data Register Definition */
typedef struct {
	volatile uint8_t SDR_L;
	volatile uint8_t SDR_H;
} SDR_Type, *SDR_MemMapPtr;


#define SERIAL_DATA_REGISTER_00_BASE											   													   	(0xFF10)
#define SDR00										  										   ((__near SDR_Type *)SERIAL_DATA_REGISTER_00_BASE)

#define SERIAL_DATA_REGISTER_01_BASE											   													   	(0xFF12)
#define SDR01										  										   ((__near SDR_Type *)SERIAL_DATA_REGISTER_01_BASE)

#define SERIAL_DATA_REGISTER_10_BASE											   													   	(0xFF14)
#define SDR10										  										   ((__near SDR_Type *)SERIAL_DATA_REGISTER_10_BASE)

#define SERIAL_DATA_REGISTER_11_BASE											   													   	(0xFF16)
#define SDR11										  										   ((__near SDR_Type *)SERIAL_DATA_REGISTER_11_BASE)





/* Serial Status Register Definition */
typedef struct {
	union {
		volatile uint8_t SSR_L;
		volatile uint8_t SSR_H;
	}ACCESS_8bit;
	volatile uint16_t SSR;
} SSR_Type, *SSR_MemMapPtr;


#define SERIAL_STATUS_REGISTER_00_BASE											   													   	(0x0100)
#define SSR00																				 ((__near SSR_Type *)SERIAL_STATUS_REGISTER_00_BASE)

#define SERIAL_STATUS_REGISTER_01_BASE											   													   	(0x0102)
#define SSR01																				 ((__near SSR_Type *)SERIAL_STATUS_REGISTER_01_BASE)

#define SERIAL_STATUS_REGISTER_10_BASE											   													   	(0x0130)
#define SSR10																				 ((__near SSR_Type *)SERIAL_STATUS_REGISTER_10_BASE)

#define SERIAL_STATUS_REGISTER_11_BASE											  	 												   	(0x0132)
#define SSR11																				 ((__near SSR_Type *)SERIAL_STATUS_REGISTER_11_BASE)


/* SSR Bit Fields */
#define SERIAL_SSR_OVF_SHIFT																												   0
#define SERIAL_SSR_OVF_MASK																												  0x0001
#define SERIAL_SSR_PEF_SHIFT																												   1
#define SERIAL_SSR_PEF_MASK																												  0x0002
#define SERIAL_SSR_FEF_SHIFT																												   2
#define SERIAL_SSR_FEF_MASK																												  0x0004
#define SERIAL_SSR_BFF_SHIFT																												   5
#define SERIAL_SSR_BFF_MASK																												  0x0020
#define SERIAL_SSR_TSF_SHIFT																												   6
#define SERIAL_SSR_TSF_MASK																												  0x0040




/* Serial Flag Clear Trigger Register Definition */
typedef struct {
	union {
		volatile uint8_t SIR_L;
		volatile uint8_t SIR_H;
	}ACCESS_8bit;
	volatile uint16_t SIR;
} SIR_Type, *SIR_MemMapPtr;


#define SERIAL_FLAG_CLEAR_TRIG_REGISTER_00_BASE										   												    (0x0104)
#define SIR00								       									((__near SIR_Type *)SERIAL_FLAG_CLEAR_TRIG_REGISTER_00_BASE)

#define SERIAL_FLAG_CLEAR_TRIG_REGISTER_01_BASE										  	 											   	(0x0106)
#define SIR01								       									((__near SIR_Type *)SERIAL_FLAG_CLEAR_TRIG_REGISTER_01_BASE)

#define SERIAL_FLAG_CLEAR_TRIG_REGISTER_10_BASE										   												   	(0x0134)
#define SIR10								       									((__near SIR_Type *)SERIAL_FLAG_CLEAR_TRIG_REGISTER_10_BASE)

#define SERIAL_FLAG_CLEAR_TRIG_REGISTER_11_BASE										   												   	(0x0136)
#define SIR11								       									((__near SIR_Type *)SERIAL_FLAG_CLEAR_TRIG_REGISTER_11_BASE)


/* SIR Bit Fields */
#define SERIAL_SIR_OVC_SHIFT																												   0
#define SERIAL_SIR_OVC_MASK																												  0x0001
#define SERIAL_SIR_PEC_SHIFT																												   1
#define SERIAL_SIR_PEC_MASK																												  0x0002
#define SERIAL_SIR_FEC_SHIFT																												   2
#define SERIAL_SIR_FEC_MASK																												  0x0004




#define SERIAL_MODE_REGISTER_00_BASE											   													   	(0x0108)
#define SMR00										  								 *((__near volatile uint16_t *)SERIAL_MODE_REGISTER_00_BASE)

#define SERIAL_MODE_REGISTER_01_BASE											   													   	(0x010A)
#define SMR01										  								 *((__near volatile uint16_t *)SERIAL_MODE_REGISTER_01_BASE)

#define SERIAL_MODE_REGISTER_10_BASE											   													   	(0x0138)
#define SMR10										  								 *((__near volatile uint16_t *)SERIAL_MODE_REGISTER_10_BASE)

#define SERIAL_MODE_REGISTER_11_BASE											   													   	(0x013A)
#define SMR11										  								 *((__near volatile uint16_t *)SERIAL_MODE_REGISTER_11_BASE)


/* SMR Bit Fields */
#define SERIAL_SMR_MD0_SHIFT																												   0
#define SERIAL_SMR_MD0_MASK																												  0x0007
#define SERIAL_SMR_MD0_VALUE(x)										   (((uint16_t)(((uint16_t)(x))<<SERIAL_SMR_MD0_SHIFT))&SERIAL_SMR_MD0_MASK)
#define SERIAL_SMR_SIS_SHIFT																												   6
#define SERIAL_SMR_SIS_MASK																												  0x0040
#define SERIAL_SMR_STS_SHIFT																												   8
#define SERIAL_SMR_STS_MASK																												  0x0100
#define SERIAL_SMR_CCS_SHIFT																												  14
#define SERIAL_SMR_CCS_MASK																												  0x4000
#define SERIAL_SMR_CKS_SHIFT																												  15
#define SERIAL_SMR_CKS_MASK																												  0x8000




#define SERIAL_COMM_OPER_REGISTER_00_BASE										   													   	(0x010C)
#define SCR00									     							*((__near volatile uint16_t *)SERIAL_COMM_OPER_REGISTER_00_BASE)

#define SERIAL_COMM_OPER_REGISTER_01_BASE										   													   	(0x010E)
#define SCR01									     							*((__near volatile uint16_t *)SERIAL_COMM_OPER_REGISTER_01_BASE)

#define SERIAL_COMM_OPER_REGISTER_10_BASE										   													   	(0x013C)
#define SCR10									     							*((__near volatile uint16_t *)SERIAL_COMM_OPER_REGISTER_10_BASE)

#define SERIAL_COMM_OPER_REGISTER_11_BASE										   													   	(0x013E)
#define SCR11									     							*((__near volatile uint16_t *)SERIAL_COMM_OPER_REGISTER_11_BASE)


