Alark8/RL78_Framework/inc/rl78_d1a_head.h
/*SCR Bit Fields */
#define SERIAL_SCR_DLS_SHIFT																												   0
#define SERIAL_SCR_DLS_MASK																												  0x000F
#define SERIAL_SCR_DLS_VALUE(x)										   (((uint16_t)(((uint16_t)(x))<<SERIAL_SCR_DLS_SHIFT))&SERIAL_SCR_DLS_MASK)
#define SERIAL_SCR_SLC_SHIFT																												   4
#define SERIAL_SCR_SLC_MASK																												  0x0030
#define SERIAL_SCR_SLC_VALUE(x)										   (((uint16_t)(((uint16_t)(x))<<SERIAL_SCR_SLC_SHIFT))&SERIAL_SCR_SLC_MASK)
#define SERIAL_SCR_DIR_SHIFT																												   7
#define SERIAL_SCR_DIR_MASK																												  0x0080
#define SERIAL_SCR_PTC_SHIFT																												   8
#define SERIAL_SCR_PTC_MASK																												  0x0300
#define SERIAL_SCR_PTC_VALUE(x)										   (((uint16_t)(((uint16_t)(x))<<SERIAL_SCR_PTC_SHIFT))&SERIAL_SCR_PTC_MASK)
#define SERIAL_SCR_DAPCKP_SHIFT																												  12
#define SERIAL_SCR_DAPCKP_MASK																											  0x3000
#define SERIAL_SCR_DAPCKP_VALUE(x)								 (((uint16_t)(((uint16_t)(x))<<SERIAL_SCR_DAPCKP_SHIFT))&SERIAL_SCR_DAPCKP_MASK)
#define SERIAL_SCR_RXTX_SHIFT																												  14
#define SERIAL_SCR_RXTX_MASK																											  0xC000
#define SERIAL_SCR_RXTX_VALUE(x)									 (((uint16_t)(((uint16_t)(x))<<SERIAL_SCR_RXTX_SHIFT))&SERIAL_SCR_RXTX_MASK)



/* ------------------------------------------------------------- Serial Control Registers --------------------------------------------------------- */










/* ------------------------------------------------------------- LVDS Control Registers ----------------------------------------------------------- */

/* Voltage Functions Register Definition */
typedef struct {
	volatile uint8_t LVIM;
	volatile uint8_t LVIS;
}LVDS_Type, *LVDS_MemMapPtr;


#define VOLTAGE_DETECTION_REGISTER_BASE											   													   	(0xFFA9)
#define LVDS									      									   ((__near LVDS_Type *)VOLTAGE_DETECTION_REGISTER_BASE)



/* LVIM Bit Fields */
#define LVDS_LVIM_LVIF_SHIFT																												   0
#define LVDS_LVIM_LVIF_MASK																													0x01
#define LVDS_LVIM_LVIOMSK_SHIFT																												   1
#define LVDS_LVIM_LVIOMSK_MASK																												0x02
#define LVDS_LVIM_LVISEN_SHIFT																												   7
#define LVDS_LVIM_LVISEN_MASK																												0x80


/* LVIS Bit Fields */
#define LVDS_LVIS_LVILV_SHIFT																												   0
#define LVDS_LVIS_LVILV_MASK																												0x01
#define LVDS_LVIS_LVIMD_SHIFT																												   7
#define LVDS_LVIS_LVIMD_MASK																												0x80

/* ------------------------------------------------------------- LVDS Control Registers ----------------------------------------------------------- */











/* ------------------------------------------------------- Priority Specification Registers ------------------------------------------------------ */

/* Priority Specification Flag Register Definition */
typedef union {
	union {
		volatile uint8_t PR_L;
		volatile uint8_t PR_H;
	}ACCESS_8bit;
	volatile uint16_t PR;
}PRS_Type, *PRS_MemMapPtr;


#define PRIORITY_SPECIFICATION_FLAG_REGISTER_00_BASE									   											   	(0xFFE8)
#define PR00								 								   ((__near PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_00_BASE)


/* PR00 Bit Fields */
#define INT_PR00_WDTIPR0_SHIFT																												   0
#define INT_PR00_WDTIPR0_MASK																											  0x0001
#define INT_PR00_LVIPR0_SHIFT																												   1
#define INT_PR00_LVIPR0_MASK																											  0x0002
#define INT_PR00_PPR00_SHIFT																												   2
#define INT_PR00_PPR00_MASK																												  0x0004
#define INT_PR00_PPR01_SHIFT																												   3
#define INT_PR00_PPR01_MASK																												  0x0008
#define INT_PR00_PPR02_SHIFT																												   4
#define INT_PR00_PPR02_MASK																												  0x0010
#define INT_PR00_PPR03_SHIFT																												   5
#define INT_PR00_PPR03_MASK																												  0x0020
#define INT_PR00_PPR04_SHIFT																												   6
#define INT_PR00_PPR04_MASK																												  0x0040
#define INT_PR00_PPR05_SHIFT																												   7
#define INT_PR00_PPR05_MASK																												  0x0080
#define INT_PR00_CLMPR0_SHIFT																												   8
#define INT_PR00_CLMPR0_MASK																											  0x0100
#define INT_PR00_CSIPR00_SHIFT																												   9
#define INT_PR00_CSIPR00_MASK																											  0x0200
#define INT_PR00_CSIPR01_SHIFT																												  10
#define INT_PR00_CSIPR01_MASK																											  0x0400
#define INT_PR00_DMAPR00_SHIFT																												  11
#define INT_PR00_DMAPR00_MASK																											  0x0800
#define INT_PR00_DMAPR01_SHIFT																												  12
#define INT_PR00_DMAPR01_MASK																											  0x1000
#define INT_PR00_RTCPR0_SHIFT																												  13
#define INT_PR00_RTCPR0_MASK																											  0x2000
#define INT_PR00_ITPR0_SHIFT																												  14
#define INT_PR00_ITPR0_MASK																												  0x4000
#define INT_PR00_LTPR00_SHIFT																												  15
#define INT_PR00_LTPR00_MASK																											  0x8000






#define PRIORITY_SPECIFICATION_FLAG_REGISTER_01_BASE									   											   	(0xFFEA)
#define PR01								 								   ((__near PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_01_BASE)


/* PR01 Bit Fields */
#define INT_PR01_LRPR00_SHIFT																												   0
#define INT_PR01_LRPR00_MASK																											  0x0001
#define INT_PR01_LSPR00_SHIFT																												   1
#define INT_PR01_LSPR00_MASK																											  0x0002
#define INT_PR01_PPR0LR0_SHIFT																												   2
#define INT_PR01_PPR0LR0_MASK																											  0x0004
#define INT_PR01_SGPR0_SHIFT																												   3
#define INT_PR01_SGPR0_MASK																												  0x0008
#define INT_PR01_TMPR000_SHIFT																												   4
#define INT_PR01_TMPR000_MASK																											  0x0010
#define INT_PR01_TMPR001_SHIFT																												   5
#define INT_PR01_TMPR001_MASK																											  0x0020
#define INT_PR01_TMPR002_SHIFT																												   6
#define INT_PR01_TMPR002_MASK																											  0x0040
#define INT_PR01_TMPR003_SHIFT																												   7
#define INT_PR01_TMPR003_MASK																											  0x0080
#define INT_PR01_ADPR0_SHIFT																											   	   8
#define INT_PR01_ADPR0_MASK																												  0x0100
#define INT_PR01_LTPR01_SHIFT																											 	   9
#define INT_PR01_LTPR01_MASK																											  0x0200
#define INT_PR01_LRPR01_SHIFT																												  10
#define INT_PR01_LRPR01_MASK																											  0x0400
#define INT_PR01_LSPR01_SHIFT																												  11
#define INT_PR01_LSPR01_MASK																											  0x0800
#define INT_PR01_PPR0LR1_SHIFT																												  12
#define INT_PR01_PPR0LR1_MASK																											  0x1000
#define INT_PR01_CSIPR010_SHIFT																												  13
#define INT_PR01_CSIPR010_MASK																											  0x2000
#define INT_PR01_IICPR011_SHIFT																												  14
#define INT_PR01_IICPR011_MASK																											  0x4000
#define INT_PR01_TMPR004_SHIFT																												  15
#define INT_PR01_TMPR004_MASK																											  0x8000







