Alark8/RL78_Framework/inc/rl78_d1a_head.h
#define PRIORITY_SPECIFICATION_FLAG_REGISTER_02_BASE									   											   	(0xFFD8)
#define PR02								 								   ((__near PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_02_BASE)


/* PR02 Bit Fields */
#define INT_PR02_TMPR005_SHIFT																												   0
#define INT_PR02_TMPR005_MASK																											  0x0001
#define INT_PR02_TMPR006_SHIFT																												   1
#define INT_PR02_TMPR006_MASK																											  0x0002
#define INT_PR02_TMPR007_SHIFT																												   2
#define INT_PR02_TMPR007_MASK																											  0x0004
#define INT_PR02_C1ERRPR0_SHIFT																												   3
#define INT_PR02_C1ERRPR0_MASK																											  0x0008
#define INT_PR02_C1WUPPR0_SHIFT																												   4
#define INT_PR02_C1WUPPR0_MASK																											  0x0010
#define INT_PR02_C0ERRPR0_SHIFT																												   5
#define INT_PR02_C0ERRPR0_MASK																											  0x0020
#define INT_PR02_C0WUPPR0_SHIFT																												   6
#define INT_PR02_C0WUPPR0_MASK																											  0x0040
#define INT_PR02_C0RECPR0_SHIFT																												   7
#define INT_PR02_C0RECPR0_MASK																											  0x0080
#define INT_PR02_C0TRXPR0_SHIFT																												   8
#define INT_PR02_C0TRXPR0_MASK																											  0x0100
#define INT_PR02_TMPR010_SHIFT																												   9
#define INT_PR02_TMPR010_MASK																										  	  0x0200
#define INT_PR02_TMPR011_SHIFT																												  10
#define INT_PR02_TMPR011_MASK																										  	  0x0400
#define INT_PR02_TMPR012_SHIFT																												  11
#define INT_PR02_TMPR012_MASK																										  	  0x0800
#define INT_PR02_TMPR013_SHIFT																												  12
#define INT_PR02_TMPR013_MASK																										  	  0x1000
#define INT_PR02_MDPR0_SHIFT																											      13
#define INT_PR02_MDPR0_MASK																											  	  0x2000
#define INT_PR02_C1RECPR0_SHIFT																												  14
#define INT_PR02_C1RECPR0_MASK																											  0x4000
#define INT_PR02_FLPR0_SHIFT																												  15
#define INT_PR02_FLPR0_MASK																											  	  0x8000







#define PRIORITY_SPECIFICATION_FLAG_REGISTER_03_BASE									   											   	(0xFFDA)
#define PR03								 								   ((__near PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_03_BASE)


/* PR03 Bit Fields */
#define INT_PR03_C1TRXPR0_SHIFT																												   0
#define INT_PR03_C1TRXPR0_MASK																											  0x0001
#define INT_PR03_TMPR014_SHIFT																												   1
#define INT_PR03_TMPR014_MASK																											  0x0002
#define INT_PR03_TMPR015_SHIFT																												   2
#define INT_PR03_TMPR015_MASK																											  0x0004
#define INT_PR03_TMPR016_SHIFT																												   3
#define INT_PR03_TMPR016_MASK																											  0x0008
#define INT_PR03_TMPR017_SHIFT																												   4
#define INT_PR03_TMPR017_MASK																											  0x0010
#define INT_PR03_TMPR020_SHIFT																												   5
#define INT_PR03_TMPR020_MASK																											  0x0020
#define INT_PR03_TMPR021_SHIFT																												   6
#define INT_PR03_TMPR021_MASK																											  0x0040
#define INT_PR03_TMPR022_SHIFT																												   7
#define INT_PR03_TMPR022_MASK																											  0x0080
#define INT_PR03_TMPR023_SHIFT																												   8
#define INT_PR03_TMPR023_MASK																											  0x0100
#define INT_PR03_TMPR024_SHIFT																												   9
#define INT_PR03_TMPR024_MASK																											  0x0200
#define INT_PR03_TMPR026_SHIFT																												  10
#define INT_PR03_TMPR026_MASK																											  0x0400
#define INT_PR03_DMAPR02_SHIFT																												  11
#define INT_PR03_DMAPR02_MASK																											  0x0800
#define INT_PR03_DMAPR03_SHIFT																												  12
#define INT_PR03_DMAPR03_MASK																											  0x1000




#define PRIORITY_SPECIFICATION_FLAG_REGISTER_10_BASE									   											   	(0xFFEC)
#define PR10								 								   ((__near PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_10_BASE)


/* PR10 Bit Fields */
#define INT_PR10_WDTIPR1_SHIFT																												   0
#define INT_PR10_WDTIPR1_MASK																											  0x0001
#define INT_PR10_LVIPR1_SHIFT																												   1
#define INT_PR10_LVIPR1_MASK																											  0x0002
#define INT_PR10_PPR10_SHIFT																												   2
#define INT_PR10_PPR10_MASK																												  0x0004
#define INT_PR10_PPR11_SHIFT																												   3
#define INT_PR10_PPR11_MASK																												  0x0008
#define INT_PR10_PPR12_SHIFT																												   4
#define INT_PR10_PPR12_MASK																												  0x0010
#define INT_PR10_PPR13_SHIFT																												   5
#define INT_PR10_PPR13_MASK																												  0x0020
#define INT_PR10_PPR14_SHIFT																												   6
#define INT_PR10_PPR14_MASK																												  0x0040
#define INT_PR10_PPR15_SHIFT																												   7
#define INT_PR10_PPR15_MASK																												  0x0080
#define INT_PR10_CLMPR1_SHIFT																												   8
#define INT_PR10_CLMPR1_MASK																											  0x0100
#define INT_PR10_CSIPR10_SHIFT																												   9
#define INT_PR10_CSIPR10_MASK																											  0x0200
#define INT_PR10_CSIPR11_SHIFT																												  10
#define INT_PR10_CSIPR11_MASK																											  0x0400
#define INT_PR10_DMAPR10_SHIFT																												  11
#define INT_PR10_DMAPR10_MASK																											  0x0800
#define INT_PR10_DMAPR11_SHIFT																												  12
#define INT_PR10_DMAPR11_MASK																											  0x1000
#define INT_PR10_RTCPR1_SHIFT																												  13
#define INT_PR10_RTCPR1_MASK																											  0x2000
#define INT_PR10_ITPR1_SHIFT																												  14
#define INT_PR10_ITPR1_MASK																												  0x4000
#define INT_PR10_LTPR10_SHIFT																												  15
#define INT_PR10_LTPR10_MASK																											  0x8000





