Alark8/RL78_Framework/inc/rl78_d1a_head.h
#define PRIORITY_SPECIFICATION_FLAG_REGISTER_11_BASE									   											   	(0xFFEE)
#define PR11								 								   ((__near PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_11_BASE)


/* PR11 Bit Fields */
#define INT_PR11_LRPR10_SHIFT																												   0
#define INT_PR11_LRPR10_MASK																											  0x0001
#define INT_PR11_LSPR10_SHIFT																												   1
#define INT_PR11_LSPR10_MASK																											  0x0002
#define INT_PR11_PPR1LR0_SHIFT																												   2
#define INT_PR11_PPR1LR0_MASK																											  0x0004
#define INT_PR11_SGPR1_SHIFT																												   3
#define INT_PR11_SGPR1_MASK																												  0x0008
#define INT_PR11_TMPR100_SHIFT																												   4
#define INT_PR11_TMPR100_MASK																											  0x0010
#define INT_PR11_TMPR101_SHIFT																												   5
#define INT_PR11_TMPR101_MASK																											  0x0020
#define INT_PR11_TMPR102_SHIFT																												   6
#define INT_PR11_TMPR102_MASK																											  0x0040
#define INT_PR11_TMPR103_SHIFT																												   7
#define INT_PR11_TMPR103_MASK																											  0x0080
#define INT_PR11_ADPR1_SHIFT																											   	   8
#define INT_PR11_ADPR1_MASK																												  0x0100
#define INT_PR11_LTPR11_SHIFT																											 	   9
#define INT_PR11_LTPR11_MASK																											  0x0200
#define INT_PR11_LRPR11_SHIFT																												  10
#define INT_PR11_LRPR11_MASK																											  0x0400
#define INT_PR11_LSPR11_SHIFT																												  11
#define INT_PR11_LSPR11_MASK																											  0x0800
#define INT_PR11_PPR1LR1_SHIFT																												  12
#define INT_PR11_PPR1LR1_MASK																											  0x1000
#define INT_PR11_CSIPR110_SHIFT																												  13
#define INT_PR11_CSIPR110_MASK																											  0x2000
#define INT_PR11_IICPR111_SHIFT																												  14
#define INT_PR11_IICPR111_MASK																											  0x4000
#define INT_PR11_TMPR104_SHIFT																												  15
#define INT_PR11_TMPR104_MASK																											  0x8000







#define PRIORITY_SPECIFICATION_FLAG_REGISTER_12_BASE									   											   	(0xFFDC)
#define PR12								 								   ((__near PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_12_BASE)


/* PR12 Bit Fields */
#define INT_PR12_TMPR105_SHIFT																												   0
#define INT_PR12_TMPR105_MASK																											  0x0001
#define INT_PR12_TMPR106_SHIFT																												   1
#define INT_PR12_TMPR106_MASK																											  0x0002
#define INT_PR12_TMPR107_SHIFT																												   2
#define INT_PR12_TMPR107_MASK																											  0x0004
#define INT_PR12_C1ERRPR1_SHIFT																												   3
#define INT_PR12_C1ERRPR1_MASK																											  0x0008
#define INT_PR12_C1WUPPR1_SHIFT																												   4
#define INT_PR12_C1WUPPR1_MASK																											  0x0010
#define INT_PR12_C0ERRPR1_SHIFT																												   5
#define INT_PR12_C0ERRPR1_MASK																											  0x0020
#define INT_PR12_C0WUPPR1_SHIFT																												   6
#define INT_PR12_C0WUPPR1_MASK																											  0x0040
#define INT_PR12_C0RECPR1_SHIFT																												   7
#define INT_PR12_C0RECPR1_MASK																											  0x0080
#define INT_PR12_C0TRXPR1_SHIFT																												   8
#define INT_PR12_C0TRXPR1_MASK																											  0x0100
#define INT_PR12_TMPR110_SHIFT																												   9
#define INT_PR12_TMPR110_MASK																										  	  0x0200
#define INT_PR12_TMPR111_SHIFT																												  10
#define INT_PR12_TMPR111_MASK																										  	  0x0400
#define INT_PR12_TMPR112_SHIFT																												  11
#define INT_PR12_TMPR112_MASK																										  	  0x0800
#define INT_PR12_TMPR113_SHIFT																												  12
#define INT_PR12_TMPR113_MASK																										  	  0x1000
#define INT_PR12_MDPR1_SHIFT																											      13
#define INT_PR12_MDPR1_MASK																											  	  0x2000
#define INT_PR12_C1RECPR1_SHIFT																												  14
#define INT_PR12_C1RECPR1_MASK																											  0x4000
#define INT_PR12_FLPR1_SHIFT																												  15
#define INT_PR12_FLPR1_MASK																											  	  0x8000



#define PRIORITY_SPECIFICATION_FLAG_REGISTER_13_BASE									   											   	(0xFFDE)
#define PR13								 								   ((__near PRS_Type *)PRIORITY_SPECIFICATION_FLAG_REGISTER_13_BASE)


/* PR13 Bit Fields */
#define INT_PR13_C1TRXPR1_SHIFT																												   0
#define INT_PR13_C1TRXPR1_MASK																											  0x0001
#define INT_PR13_TMPR114_SHIFT																												   1
#define INT_PR13_TMPR114_MASK																											  0x0002
#define INT_PR13_TMPR115_SHIFT																												   2
#define INT_PR13_TMPR115_MASK																											  0x0004
#define INT_PR13_TMPR116_SHIFT																												   3
#define INT_PR13_TMPR116_MASK																											  0x0008
#define INT_PR13_TMPR117_SHIFT																												   4
#define INT_PR13_TMPR117_MASK																											  0x0010
#define INT_PR13_TMPR120_SHIFT																												   5
#define INT_PR13_TMPR120_MASK																											  0x0020
#define INT_PR13_TMPR121_SHIFT																												   6
#define INT_PR13_TMPR121_MASK																											  0x0040
#define INT_PR13_TMPR122_SHIFT																												   7
#define INT_PR13_TMPR122_MASK																											  0x0080
#define INT_PR13_TMPR123_SHIFT																												   8
#define INT_PR13_TMPR123_MASK																											  0x0100
#define INT_PR13_TMPR124_SHIFT																												   9
#define INT_PR13_TMPR124_MASK																											  0x0200
#define INT_PR13_TMPR126_SHIFT																												  10
#define INT_PR13_TMPR126_MASK																											  0x0400
#define INT_PR13_DMAPR12_SHIFT																												  11
#define INT_PR13_DMAPR12_MASK																											  0x0800
#define INT_PR13_DMAPR13_SHIFT																												  12
#define INT_PR13_DMAPR13_MASK																											  0x1000



