Alark8/RL78_Framework/inc/rl78_d1a_head.h
/* ------------------------------------------------------- Priority Specification Registers ------------------------------------------------------ */










/* ----------------------------------------------------------- LCD Configuration Handlers ------------------------------------------------------------ */

typedef struct {
	volatile uint8_t LCDMD;
	volatile uint8_t LCDM;
	volatile uint8_t LCDC0;
	volatile uint8_t BL;
	union {
		union {
			volatile uint8_t LBDATA;
			volatile uint8_t LBDATAL;
		}ACCESS_8bit;
		volatile uint16_t LBDAT;
	}DREG;
	union {
		union {
			volatile uint8_t LBDATAR;
			volatile uint8_t LBDATARL;
		}ACCESS_8bit;
		volatile uint16_t LBDATR;
	}RDREG;
}LCD_Config0_Type, *LCD_Config0_MemMapPtr;


#define LCD_CONFIG_0_REGISTER_BASE																									   	(0xFF40)
#define LCD_CONFIG0																		 ((__near LCD_Config0_Type *)LCD_CONFIG_0_REGISTER_BASE)


/* LCDMD Bit Fields */
#define LCD_LCDMD_MDSET_SHIFT																												   4
#define LCD_LCDMD_MDSET_MASK																												0x30
#define LCD_LCDMD_MDSET_VALUE(x)									   (((uint8_t)(((uint8_t)(x))<<LCD_LCDMD_MDSET_SHIFT))&LCD_LCDMD_MDSET_MASK)


/* LCDM Bit Fields */
#define LCD_LCDM_SHIFT																														   0
#define LCD_LCDM_MASK																														0x05
#define LCD_LCDM_VALUE(x)															 (((uint8_t)(((uint8_t)(x))<<LCD_LCDM_SHIFT))&LCD_LCDM_MASK)
#define LCD_LCDM_SCOC_SHIFT																													   6
#define LCD_LCDM_SCOC_MASK																													0x40
#define LCD_LCDM_LCDON_SHIFT																												   7
#define LCD_LCDM_LCDON_MASK																													0x80


/* LCDC0 Bit Fields */
#define LCD_LCDC0_SHIFT																														   0
#define LCD_LCDC0_MASK																														0x07
#define LCD_LCDC0_VALUE(x)														   (((uint8_t)(((uint8_t)(x))<<LCD_LCDC0_SHIFT))&LCD_LCDC0_MASK)
#define LCD_LCDC4_SHIFT																														   4
#define LCD_LCDC4_MASK																														0x70
#define LCD_LCDC4_VALUE(x)														   (((uint8_t)(((uint8_t)(x))<<LCD_LCDC4_SHIFT))&LCD_LCDC4_MASK)








typedef struct {
	volatile uint8_t SEG0;
	volatile uint8_t SEG1;
	volatile uint8_t SEG2;
	volatile uint8_t SEG3;
	volatile uint8_t SEG4;
	volatile uint8_t SEG5;
	volatile uint8_t SEG6;
	volatile uint8_t SEG7;
	volatile uint8_t SEG8;
	volatile uint8_t SEG9;
	volatile uint8_t SEG10;
	volatile uint8_t SEG11;
	volatile uint8_t SEG12;
	volatile uint8_t SEG13;
	volatile uint8_t SEG14;
	volatile uint8_t SEG15;
	volatile uint8_t SEG16;
	volatile uint8_t SEG17;
	volatile uint8_t SEG18;
	volatile uint8_t SEG19;
	volatile uint8_t SEG20;
	volatile uint8_t SEG21;
	volatile uint8_t SEG22;
	volatile uint8_t SEG23;
	volatile uint8_t SEG24;
	volatile uint8_t SEG25;
	volatile uint8_t SEG26;
	volatile uint8_t SEG27;
	volatile uint8_t SEG28;
	volatile uint8_t SEG29;
	volatile uint8_t SEG30;
	volatile uint8_t SEG31;
	volatile uint8_t SEG32;
	volatile uint8_t SEG33;
	volatile uint8_t SEG34;
	volatile uint8_t SEG35;
	volatile uint8_t SEG36;
	volatile uint8_t SEG37;
	volatile uint8_t SEG38;
	volatile uint8_t SEG39;
	volatile uint8_t SEG40;
	volatile uint8_t SEG41;
	volatile uint8_t SEG42;
	volatile uint8_t SEG43;
	volatile uint8_t SEG44;
	volatile uint8_t SEG45;
	volatile uint8_t SEG46;
	volatile uint8_t SEG47;
	volatile uint8_t SEG48;
	volatile uint8_t SEG49;
	volatile uint8_t SEG50;
	volatile uint8_t SEG51;
	volatile uint8_t SEG52;
	volatile uint8_t SEG53;
}LCD_DATA_Type, *LCD_DATA_MemMapPtr;


#define LCD_DATA_REGISTER_BASE																										   	(0x0300)
#define LCD_DATA																				((__near LCD_DATA_Type *)LCD_DATA_REGISTER_BASE)





typedef struct {
	volatile uint8_t LBCTL;
	volatile uint8_t LBCYC;
	volatile uint8_t LBWST;
}LCD_Config1_Type, *LCD_Config1_MemMapPtr;


#define LCD_CONFIG_1_REGISTER_BASE																									   	(0x0018)
#define LCD_CONFIG1																		 ((__near LCD_Config1_Type *)LCD_CONFIG_1_REGISTER_BASE)


/* LBCTL Bit Fields */
#define LCD_LBCTL_BYF_SHIFT																													   0
#define LCD_LBCTL_BYF_MASK																													0x01
#define LCD_LBCTL_TPF_SHIFT																													   1
#define LCD_LBCTL_TPF_MASK																													0x02
#define LCD_LBCTL_TCIS_SHIFT																												   3
#define LCD_LBCTL_TCIS_MASK																													0x08
#define LCD_LBCTL_LBC_SHIFT																													   4
#define LCD_LBCTL_LBC_MASK																													0x30
#define LCD_LBCTL_LBC_VALUE(x)											   (((uint8_t)(((uint8_t)(x))<<LCD_LBCTL_LBC_SHIFT))&LCD_LBCTL_LBC_MASK)
#define LCD_LBCTL_IMD_SHIFT																													   6
#define LCD_LBCTL_IMD_MASK																													0x40
#define LCD_LBCTL_EL_SHIFT																													   7
#define LCD_LBCTL_EL_MASK																													0x80


/* LBCYC Bit Fields */
#define LCD_LBCYC_CYC_SHIFT																													   0
#define LCD_LBCYC_CYC_MASK																													0x3F
#define LCD_LBCYC_CYC_VALUE(x)											   (((uint8_t)(((uint8_t)(x))<<LCD_LBCYC_CYC_SHIFT))&LCD_LBCYC_CYC_MASK)


/* LBWST Bit Fields */
#define LCD_LBWST_WST_SHIFT																													   0
#define LCD_LBWST_WST_MASK																													0x1F
#define LCD_LBWST_WST_VALUE(x)											   (((uint8_t)(((uint8_t)(x))<<LCD_LBWST_WST_SHIFT))&LCD_LBWST_WST_MASK)






/* ----------------------------------------------------------- LCD Configuration Handlers ------------------------------------------------------------ */













/* ---------------------------------------------------------- UART Configuration Handlers ------------------------------------------------------------ */

typedef struct {
	volatile uint16_t UFTX;
	volatile uint16_t UFRX;
}LIN_UART_DR_Type, *LIN_UART_DR_MemMapPtr;


#define LIN_UART0_DATA_REGISTER_ADDRESS																								   	(0xFF48)
#define LIN_UART_DR0																((__near LIN_UART_DR_Type *)LIN_UART0_DATA_REGISTER_ADDRESS)

#define LIN_UART1_DATA_REGISTER_ADDRESS																								   	(0xFF4C)
#define LIN_UART_DR1																((__near LIN_UART_DR_Type *)LIN_UART1_DATA_REGISTER_ADDRESS)





