Alark8/RL78_Framework/inc/rl78_d1a_head.h
typedef struct {
	volatile uint8_t UFCTL0;
	volatile uint8_t UFOPT0;
	volatile uint16_t UFCTL1;
	volatile uint8_t UFOPT1;
	volatile uint8_t UFOPT2;
	volatile uint16_t UFSTR;
	volatile uint16_t UFSTC;
	volatile uint16_t UFWTX;
	volatile uint8_t UFID;
	struct {
		volatile uint8_t UFBUF0;
		volatile uint8_t UFBUF1;
		volatile uint8_t UFBUF2;
		volatile uint8_t UFBUF3;
		volatile uint8_t UFBUF4;
		volatile uint8_t UFBUF5;
		volatile uint8_t UFBUF6;
		volatile uint8_t UFBUF7;
		volatile uint8_t UFBUF8;
	}DATA;
	volatile uint16_t UFBUCTL;
}LIN_UART_Type, *LIN_UART_MemMapPtr;


#define LIN_UART0_REGISTER_BASE																										   	(0x0240)
#define LIN_UART0																			   ((__near LIN_UART_Type *)LIN_UART0_REGISTER_BASE)

#define LIN_UART1_REGISTER_BASE																										   	(0x0260)
#define LIN_UART1																			   ((__near LIN_UART_Type *)LIN_UART1_REGISTER_BASE)



/* UFCTL0 Bit Fields */
#define UARTF_UFCTL0_UFSL_SHIFT																												   0
#define UARTF_UFCTL0_UFSL_MASK																												0x01
#define UARTF_UFCTL0_UFCL_SHIFT																												   1
#define UARTF_UFCTL0_UFCL_MASK																												0x02
#define UARTF_UFCTL0_UFPS_SHIFT																												   2
#define UARTF_UFCTL0_UFPS_MASK																												0x0C
#define UARTF_UFCTL0_UFPS_VALUE(x)								   (((uint8_t)(((uint8_t)(x))<<UARTF_UFCTL0_UFPS_SHIFT))&UARTF_UFCTL0_UFPS_MASK)
#define UARTF_UFCTL0_UFDIR_SHIFT																											   4
#define UARTF_UFCTL0_UFDIR_MASK																												0x10
#define UARTF_UFCTL0_UFRX_SHIFT																												   5
#define UARTF_UFCTL0_UFRX_MASK																												0x20
#define UARTF_UFCTLO_UFTX_SHIFT																												   6
#define UARTF_UFCTLO_UFTX_MASK																												0x40


/* UFOPT0 Bit Fields */
#define UARTF_UFOPT0_UFRDL_SHIFT																											   0
#define UARTF_UFOPT0_UFRDL_MASK																												0x01
#define UARTF_UFOPT0_UFTDL_SHIFT																											   1
#define UARTF_UFOPT0_UFTDL_MASK																												0x02
#define UARTF_UFOPT0_UFBLS_SHIFT																											   2
#define UARTF_UFOPT0_UFBLS_MASK																												0x1C
#define UARTF_UFOPT0_UFBLS_VALUE(x)								 (((uint8_t)(((uint8_t)(x))<<UARTF_UFOPT0_UFBLS_SHIFT))&UARTF_UFOPT0_UFBLS_MASK)
#define UARTF_UFOPT0_UFBTT_SHIFT																											   5
#define UARTF_UFOPT0_UFBTT_MASK																												0x20
#define UARTF_UFOPT0_UFBRT_SHIFT																											   6
#define UARTF_UFOPT0_UFBRT_MASK																												0x40
#define UARTF_UFOPT0_UFBRF_SHIFT																											   7
#define UARTF_UFOPT0_UFBRF_MASK																												0x80


/* UFCTL1 Bit Fields */
#define UARTF_UFCTL1_UFBRS_SHIFT																											   0
#define UARTF_UFCTL1_UFBRS_MASK																											  0x0FFF
#define UARTF_UFCTL1_UFBRS_VALUE(x)							   (((uint16_t)(((uint16_t)(x))<<UARTF_UFCTL1_UFBRS_SHIFT))&UARTF_UFCTL1_UFBRS_MASK)
#define UARTF_UFCTL1_UFPRS_SHIFT																											  13
#define UARTF_UFCTL1_UFPRS_MASK																											  0xE000
#define UARTF_UFCTL1_UFPRS_VALUE(x)							   (((uint16_t)(((uint16_t)(x))<<UARTF_UFCTL1_UFPRS_SHIFT))&UARTF_UFCTL1_UFPRS_MASK)


/* UFOPT1 Bit Fields */
#define UARTF_UFOPT1_UFDCS_SHIFT																											   0
#define UARTF_UFOPT1_UFDCS_MASK																												0x01
#define UARTF_UFOPT1_UFMD0_SHIFT																											   1
#define UARTF_UFOPT1_UFMD0_MASK																												0x06
#define UARTF_UFOPT1_UFMDO_VALUE(x)								 (((uint8_t)(((uint8_t)(x))<<UARTF_UFOPT1_UFMD0_SHIFT))&UARTF_UFOPT1_UFMD0_MASK)
#define UARTF_UFOPT1_UFACE_SHIFT																											   3
#define UARTF_UFOPT1_UFACE_MASK																												0x08
#define UARTF_UFOPT1_UFIPCS_SHIFT																											   4
#define UARTF_UFOPT1_UFIPCS_MASK																											0x10
#define UARTF_UFOPT1_UFEBC_SHIFT																											   5
#define UARTF_UFOPT1_UFEBC_MASK																												0x20
#define UARTF_UFOPT1_UFEBL_SHIFT																											   6
#define UARTF_UFOPT1_UFEBL_MASK																												0x40
#define UARTF_UFOPT1_UFEBE_SHIFT																											   7
#define UARTF_UFOPT1_UFEBE_MASK																												0x80


/* UFOPT2 Bit Fields */
#define UARTF_UFOPT2_UFITS_SHIFT																											   0
#define UARTF_UFOPT2_UFITS_MASK																												0x01
#define UARTF_UFOPT2_UFRXFL_SHIFT																											   1
#define UARTF_UFOPT2_UFRXFL_MASK																											0x02


/* UFSTR Bit Fields */
#define UARTF_UFSTR_UFOVE_SHIFT																												   0
#define UARTF_UFSTR_UFOVE_MASK																											  0x0001
#define UARTF_UFSTR_UFFE_SHIFT																												   1
#define UARTF_UFSTR_UFFE_MASK																											  0x0002
#define UARTF_UFSTR_UFPE_SHIFT																												   2
#define UARTF_UFSTR_UFPE_MASK																											  0x0004
#define UARTF_UFSTR_UFDCE_SHIFT																												   3
#define UARTF_UFSTR_UFDCE_MASK																											  0x0008
#define UARTF_UFSTR_UFBSF_SHIFT																												   4
#define UARTF_UFSTR_UFBSF_MASK																											  0x0010
#define UARTF_UFSTR_UFRSF_SHIFT																												   6
#define UARTF_UFSTR_UFRSF_MASK																											  0x0040
#define UARTF_UFSTR_UFTSF_SHIFT																												   7
#define UARTF_UFSTR_UFTSF_MASK																											  0x0080
#define UARTF_UFSTR_UFEBD_SHIFT																												   8
#define UARTF_UFSTR_UFEBD_MASK																											  0x0100
#define UARTF_UFSTR_UFIDM_SHIFT																												   9
#define UARTF_UFSTR_UFIDM_MASK																											  0x0200
#define UARTF_UFSTR_UFBUC_SHIFT																												  10
#define UARTF_UFSTR_UFBUC_MASK																											  0x0400
#define UARTF_UFSTR_UFHDC_SHIFT																												  11
#define UARTF_UFSTR_UFHDC_MASK																											  0x0800
#define UARTF_UFSTR_UFRPE_SHIFT																												  12
#define UARTF_UFSTR_UFRPE_MASK																											  0x1000
#define UARTF_UFSTR_UFCSE_SHIFT																												  13
#define UARTF_UFSTR_UFCSE_MASK																											  0x2000
#define UARTF_UFSTR_UFIPE_SHIFT																												  14
#define UARTF_UFSTR_UFIPE_MASK																											  0x4000


