Alark8/RL78_Framework/inc/rl78_d1a_head.h
/* UFSTC Bit Fields */
#define UARTF_UFSTC_UFCLOVE_SHIFT																											   0
#define UARTF_UFSTC_UFCLOVE_MASK																										  0x0001
#define UARTF_UFSTC_UFCLFE_SHIFT																											   1
#define UARTF_UFSTC_UFCLFE_MASK																											  0x0002
#define UARTF_UFSTC_UFCLPE_SHIFT																											   2
#define UARTF_UFSTC_UFCLPE_MASK																											  0x0004
#define UARTF_UFSTC_UFCLDCE_SHIFT																											   3
#define UARTF_UFSTC_UFCLDCE_MASK																										  0x0008
#define UARTF_UFSTC_UFCLBSF_SHIFT																											   4
#define UARTF_UFSTC_UFCLBSF_MASK																										  0x0010
#define UARTF_UFSTC_UFCLEBD_SHIFT																											   8
#define UARTF_UFSTC_UFCLEBD_MASK																										  0x0100
#define UARTF_UFSTC_UFCLIDM_SHIFT																											   9
#define UARTF_UFSTC_UFCLIDM_MASK																										  0x0200
#define UARTF_UFSTC_UFCLBUC_SHIFT																											  10
#define UARTF_UFSTC_UFCLBUC_MASK																										  0x0400
#define UARTF_UFSTC_UFCLHDC_SHIFT																											  11
#define UARTF_UFSTC_UFCLHDC_MASK																										  0x0800
#define UARTF_UFSTC_UFCLRPE_SHIFT																											  12
#define UARTF_UFSTC_UFCLRPE_MASK																										  0x1000
#define UARTF_UFSTC_UFCLCSE_SHIFT																											  13
#define UARTF_UFSTC_UFCLCSE_MASK																										  0x2000
#define UARTF_UFSTC_UFCLIPE_SHIFT																											  14
#define UARTF_UFSTC_UFCLIPE_MASK																										  0x4000


/* UFBUCTL Bit Fields */
#define UARTF_UFBUCTL_UFBUL_SHIFT																											   0
#define UARTF_UFBUCTL_UFBUL_MASK																										  0x000F
#define UARTF_UFBUCTL_UFBUL_VALUE(x)						 (((uint16_t)(((uint16_t)(x))<<UARTF_UFBUCTL_UFBUL_SHIFT))&UARTF_UFBUCTL_UFBUL_MASK)
#define UARTF_UFBUCTL_UFTRQ_SHIFT																											   4
#define UARTF_UFBUCTL_UFTRQ_MASK																										  0x0010
#define UARTF_UFBUCTL_UFRRQ_SHIFT																											   5
#define UARTF_UFBUCTL_UFRRQ_MASK																										  0x0020
#define UARTF_UFBUCTL_UFNO_SHIFT																											   6
#define UARTF_UFBUCTL_UFNO_MASK																											  0x0040
#define UARTF_UFBUCTL_UFECS_SHIFT																											   7
#define UARTF_UFBUCTL_UFECS_MASK																										  0x0080
#define UARTF_UFBUCTL_UFCON_SHIFT																											   8
#define UARTF_UFBUCTL_UFCON_MASK																										  0x0100
#define UARTF_UFBUCTL_UFTW_SHIFT																											   9
#define UARTF_UFBUCTL_UFTW_MASK																											  0x0200



/* ---------------------------------------------------------- UART Configuration Handlers ------------------------------------------------------------ */











/* --------------------------------------------------------- PINSEL Configuration Handlers ----------------------------------------------------------- */

typedef struct {
	volatile uint8_t STSEL0;
	volatile uint8_t STSEL1;
	volatile uint8_t TISELSE;
	volatile uint8_t SGSEL;
}PINSEL_Type, *PINSEL_MemMapPtr;


#define PIN_SELECT_00_REGISTER_BASE																									   	(0xFF3C)
#define PINSEL0																				 ((__near PINSEL_Type *)PIN_SELECT_00_REGISTER_BASE)



/* STSEL0 Bit Fields */
#define PINSEL_STSEL0_SUARTF0_SHIFT																											   0
#define PINSEL_STSEL0_SUARTF0_MASK																											0x01
#define PINSEL_STSEL0_SUARTF1_SHIFT																											   1
#define PINSEL_STSEL0_SUARTF1_MASK																											0x02
#define PINSEL_STSEL0_SCSI000_SHIFT																											   2
#define PINSEL_STSEL0_SCSI000_MASK																											0x0C
#define PINSEL_STSEL0_SCSI000_VALUE(x)					   (((uint8_t)(((uint8_t)(x))<<PINSEL_STSEL0_SCSI000_SHIFT))&PINSEL_STSEL0_SCSI000_MASK)
#define PINSEL_STSEL0_SCSI010_SHIFT																											   4
#define PINSEL_STSEL0_SCSI010_MASK																											0x10
#define PINSEL_STSEL0_SCSI100_SHIFT																											   6
#define PINSEL_STSEL0_SCSI100_MASK																											0x40


/* STSEL1 Bit Fields */
#define PINSEL_STSEL1_TMCAN_SHIFT																											   0
#define PINSEL_STSEL1_TMCAN_MASK																											0x03
#define PINSEL_STSEL1_TMCAN_VALUE(x)						   (((uint8_t)(((uint8_t)(x))<<PINSEL_STSEL1_TMCAN_SHIFT))&PINSEL_STSEL1_TMCAN_MASK)
#define PINSEL_STSEL1_SCAN_SHIFT																											   2
#define PINSEL_STSEL1_SCAN_MASK																												0x0C
#define PINSEL_STSEL1_SCAN_VALUE(x)								 (((uint8_t)(((uint8_t)(x))<<PINSEL_STSEL1_SCAN_SHIFT))&PINSEL_STSEL1_SCAN_MASK)
#define PINSEL_STSEL1_SIIC_SHIFT																											   6
#define PINSEL_STSEL1_SIIC_MASK																												0xC0
#define PINSEL_STSEL1_SIIC_VALUE(x)								 (((uint8_t)(((uint8_t)(x))<<PINSEL_STSEL1_SIIC_SHIFT))&PINSEL_STSEL1_SIIC_MASK)


/* TISELSE Bit Fields */
#define PINSEL_TISELSE_TI05SEL_SHIFT																										   0
#define PINSEL_TISELSE_TI05SEL_MASK																											0x03
#define PINSEL_TISELSE_TI05SEL_VALUE(x)					 (((uint8_t)(((uint8_t)(x))<<PINSEL_TISELSE_TI05SEL_SHIFT))&PINSEL_TISELSE_TI05SEL_MASK)
#define PINSEL_TISELSE_TOTICON_SHIFT																										   6
#define PINSEL_TISELSE_TOTICON_MASK																											0xC0
#define PINSEL_TISELSE_TOTICON_VALUE(x)					 (((uint8_t)(((uint8_t)(x))<<PINSEL_TISELSE_TOTICON_SHIFT))&PINSEL_TISELSE_TOTICON_MASK)


/* SGSEL Bit Fields */
#define PINSEL_SGSEL_SHIFT																													   0
#define PINSEL_SGSEL_MASK																													0x07
#define PINSEL_SGSEL_VALUE(x)												 (((uint8_t)(((uint8_t)(x))<<PINSEL_SGSEL_SHIFT))&PINSEL_SGSEL_MASK)
#define PINSEL_SGSEL_PCLSEL_SHIFT																											   3
#define PINSEL_SGSEL_PCLSEL_MASK																											0x08

/* --------------------------------------------------------- PINSEL Configuration Handlers ----------------------------------------------------------- */












/* ----------------------------------------------------------- PLL Configuration Handlers ------------------------------------------------------------ */

