Alark8/RL78_Framework/inc/rl78_d1a_head.h
typedef struct {
	volatile uint8_t PLLSTS;
	volatile uint8_t PLLCTL;
}PLL_Type, *PLL_MemMapPtr;


#define PLL_CONFIG_REGISTER_BASE																									   	(0x0128)
#define PLL																						   ((__near PLL_Type *)PLL_CONFIG_REGISTER_BASE)


/* PLLSTS Bit Fields */
#define PLL_PLLSTS_SELPLLS_SHIFT																											   3
#define PLL_PLLSTS_SELPLLS_MASK																												0x08
#define PLL_PLLSTS_LOCK_SHIFT																												   7
#define PLL_PLLSTS_LOCK_MASK																												0x80


/* PLLCTL Bit Fields */
#define PLL_PLLCTL_PLLON_SHIFT																												   0
#define PLL_PLLCTL_PLLON_MASK																												0x01
#define PLL_PLLCTL_SELPLL_SHIFT																												   2
#define PLL_PLLCTL_SELPLL_MASK																												0x04
#define PLL_PLLCTL_PLLDIV0_SHIFT																											   4
#define PLL_PLLCTL_PLLDIV0_MASK																												0x10
#define PLL_PLLCTL_LCKSEL_SHIFT																												   6
#define PLL_PLLCTL_LCKSEL_MASK																												0xC0
#define PLL_PLLCTL_LCKSEL_VALUE(x)								   (((uint8_t)(((uint8_t)(x))<<PLL_PLLCTL_LCKSEL_SHIFT))&PLL_PLLCTL_LCKSEL_MASK)


/* ----------------------------------------------------------- PLL Configuration Handlers ------------------------------------------------------------ */












/* ---------------------------------------------------- Sound Generator Configuration Handlers ------------------------------------------------------- */

typedef struct {
	volatile uint16_t SGFL;
	volatile uint16_t SGFH;
	volatile uint16_t SGPWM;
	volatile uint8_t SGSDF;
	volatile uint8_t SGCTL;
	volatile uint16_t SGITH;
}SG_Type, *SG_MemMapPtr;


#define SOUND_GENERATOR_CONFIG_REGISTER_BASE																						   	(0x0280)
#define SG																				((__near SG_Type *)SOUND_GENERATOR_CONFIG_REGISTER_BASE)


/* SGFL Bit Fields */
#define SG_SGFL_SHIFT																														   0
#define SG_SGFL_MASK																													  0x01FF
#define SG_SGFL_VALUE(x)															 (((uint16_t)(((uint16_t)(x))<<SG_SGFL_SHIFT))&SG_SGFL_MASK)


/* SGFH Bit Fields */
#define SG_SGFH_SHIFT																														   0
#define SG_SGFH_MASK																													  0x01FF
#define SG_SGFH_VALUE(x)															 (((uint16_t)(((uint16_t)(x))<<SG_SGFH_SHIFT))&SG_SGFH_MASK)


/* SGPWM Bit Fields */
#define SG_SGPWM_SHIFT																														   0
#define SG_SGPWM_MASK																													  0x01FF
#define SG_SGPWM_VALUE(x)														   (((uint16_t)(((uint16_t)(x))<<SG_SGPWM_SHIFT))&SG_SGPWM_MASK)


/* SGCTL Bit Fields */
#define SG_SGCTL_SGALDS_SHIFT																												   0
#define SG_SGCTL_SGALDS_MASK																												0x01
#define SG_SGCTL_SGOS_SHIFT																													   1
#define SG_SGCTL_SGOS_MASK																													0x02
#define SG_SGCTL_SGPWR_SHIFT																												   4
#define SG_SGCTL_SGPWR_MASK																													0x10


/* SGITH Bit Fields */
#define SG_SGITH_SHIFT																														   0
#define SG_SGITH_MASK																													  0x01FF
#define SG_SGITH_VALUE(x)														   (((uint16_t)(((uint16_t)(x))<<SG_SGITH_SHIFT))&SG_SGITH_MASK)

/* ---------------------------------------------------- Sound Generator Configuration Handlers ------------------------------------------------------- */











/* ----------------------------------------------------------- ZPD Configuration Handlers ------------------------------------------------------------ */

typedef struct {
	volatile uint8_t ZPDS0;
	volatile uint8_t ZPDS1;
	volatile uint8_t CMPCTL;
	volatile uint8_t ZPDEN;
}ZPD_Type, *ZPD_MemMapPtr;


#define ZPD_CONTROL_REGISTER_BASE																									   	(0x015C)
#define ZPD																						  ((__near ZPD_Type *)ZPD_CONTROL_REGISTER_BASE)


/* ZPDS0 Bit Fields */
#define ZPD_ZPDS0_ZPD1S_SHIFT																												   0
#define ZPD_ZPDS0_ZPD1S_MASK																												0x07
#define ZPD_ZPDS0_ZPD1S_VALUE(x)									   (((uint8_t)(((uint8_t)(x))<<ZPD_ZPDS0_ZPD1S_SHIFT))&ZPD_ZPDS0_ZPD1S_MASK)
#define ZPD_ZPDS0_ZPD1PC_SHIFT																												   3
#define ZPD_ZPDS0_ZPD1PC_MASK																												0x08
#define ZPD_ZPDS0_ZPD2S_SHIFT																												   4
#define ZPD_ZPDS0_ZPD2S_MASK																												0x70
#define ZPD_ZPDS0_ZPD2S_VALUE(x)									   (((uint8_t)(((uint8_t)(x))<<ZPD_ZPDS0_ZPD2S_SHIFT))&ZPD_ZPDS0_ZPD2S_MASK)
#define ZPD_ZPDS0_ZPD2PC_SHIFT																												   7
#define ZPD_ZPDS0_ZPD2PC_MASK																												0x80


/* ZPDS1 Bit Fields */
#define ZPD_ZPDS1_ZPD3S_SHIFT																												   0
#define ZPD_ZPDS1_ZPD3S_MASK																												0x07
#define ZPD_ZPDS1_ZPD3S_VALUE(x)									   (((uint8_t)(((uint8_t)(x))<<ZPD_ZPDS1_ZPD3S_SHIFT))&ZPD_ZPDS1_ZPD3S_MASK)
#define ZPD_ZPDS1_ZPD3PC_SHIFT																												   3
#define ZPD_ZPDS1_ZPD3PC_MASK																												0x08
#define ZPD_ZPDS1_ZPD4S_SHIFT																												   4
#define ZPD_ZPDS1_ZPD4S_MASK																												0x70
#define ZPD_ZPDS1_ZPD4S_VALUE(x)									   (((uint8_t)(((uint8_t)(x))<<ZPD_ZPDS1_ZPD4S_SHIFT))&ZPD_ZPDS1_ZPD4S_MASK)
#define ZPD_ZPDS1_ZPD4PC_SHIFT																												   7
#define ZPD_ZPDS1_ZPD4PC_MASK																												0x80


/* CMPCTL Bit Fields */
#define ZPD_CMPCTL_DBCL_SHIFT																												   0
#define ZPD_CMPCTL_DBCL_MASK																												0x0F
#define ZPD_CMPCTL_DBCL_VALUE(x)									   (((uint8_t)(((uint8_t)(x))<<ZPD_CMPCTL_DBCL_SHIFT))&ZPD_CMPCTL_DBCL_MASK)


/* ZPDEN Bit Fields */
#define ZPD_ZPDEN_SHIFT																														   0
#define ZPD_ZPDEN_MASK																														0x0F
#define ZPD_ZPDEN_VALUE(x)														   (((uint8_t)(((uint8_t)(x))<<ZPD_ZPDEN_SHIFT))&ZPD_ZPDEN_MASK)

/* ----------------------------------------------------------- ZPD Configuration Handlers ------------------------------------------------------------ */












/* ----------------------------------------------------------- CMP Configuration Handlers ------------------------------------------------------------ */

