Alark8/RL78_Framework/inc/rl78_d1a_head.h
typedef struct {
	union{
		volatile uint8_t MCMP_L;
		volatile uint8_t MCMP_H;
	}ACCESS_8bit;
	volatile uint16_t MCMP;
}CMP_Type, *CMP_MemMapPtr;


#define COMPARE_REGISTER_10_BASE																									   	(0x0162)
#define CMP10																					   ((__near CMP_Type *)COMPARE_REGISTER_10_BASE)

#define COMPARE_REGISTER_20_BASE																									   	(0x0164)
#define CMP20																					   ((__near CMP_Type *)COMPARE_REGISTER_20_BASE)

#define COMPARE_REGISTER_30_BASE																									   	(0x0166)
#define CMP30																					   ((__near CMP_Type *)COMPARE_REGISTER_30_BASE)

#define COMPARE_REGISTER_40_BASE																									   	(0x0168)
#define CMP40																					   ((__near CMP_Type *)COMPARE_REGISTER_40_BASE)





#define TIMER_MODE_CONTROL_REGISTER_BASE																							   	(0x0160)
#define MCNTC0																	  *((__near volatile uint8_t *)TIMER_MODE_CONTROL_REGISTER_BASE)


/* MCNTC0 Bit Fields */
#define TIMER_MCNTC0_SMCL_SHIFT																												   0
#define TIMER_MCNTC0_SMCL_MASK																												0x07
#define TIMER_MCNTC0_SMCL_VALUE(x)							 	   (((uint8_t)(((uint8_t)(x))<<TIMER_MCNTC0_SMCL_SHIFT))&TIMER_MCNTC0_SMCL_MASK)
#define TIMER_MCNTC0_PCS_SHIFT																												   3
#define TIMER_MCNTC0_PCS_MASK																												0x08
#define TIMER_MCNTC0_PCE_SHIFT																												   4
#define TIMER_MCNTC0_PCE_MASK																												0x10
#define TIMER_MCNTC0_FULL_SHIFT																												   5
#define TIMER_MCNTC0_FULL_MASK																												0x20
#define TIMER_MCNTC0_CAE_SHIFT																												   7
#define TIMER_MCNTC0_CAE_MASK																												0x80





#define COMPARE_CONTROL_REGISTER_1_BASE																								   	(0x016A)
#define MCMPC1																	   *((__near volatile uint8_t *)COMPARE_CONTROL_REGISTER_1_BASE)

#define COMPARE_CONTROL_REGISTER_2_BASE																								   	(0x016C)
#define MCMPC2																	   *((__near volatile uint8_t *)COMPARE_CONTROL_REGISTER_2_BASE)

#define COMPARE_CONTROL_REGISTER_3_BASE																								   	(0x016E)
#define MCMPC3																	   *((__near volatile uint8_t *)COMPARE_CONTROL_REGISTER_3_BASE)

#define COMPARE_CONTROL_REGISTER_4_BASE																								   	(0x0158)
#define MCMPC4																	   *((__near volatile uint8_t *)COMPARE_CONTROL_REGISTER_4_BASE)


/* MCMPC Bit Fields */
#define CMP_MCMPC_DIR_SHIFT																													   0
#define CMP_MCMPC_DIR_MASK																													0x03
#define CMP_MCMPC_DIR_VALUE(x)											   (((uint8_t)(((uint8_t)(x))<<CMP_MCMPC_DIR_SHIFT))&CMP_MCMPC_DIR_MASK)
#define CMP_MCMPC_ADB_SHIFT																													   2
#define CMP_MCMPC_ADB_MASK																													0x0C
#define CMP_MCMPC_ADB_VALUE(x)											   (((uint8_t)(((uint8_t)(x))<<CMP_MCMPC_ADB_SHIFT))&CMP_MCMPC_ADB_MASK)
#define CMP_MCMPC_TEN_SHIFT																													   4
#define CMP_MCMPC_TEN_MASK																													0x10
#define CMP_MCMPC_ZPD_SHIFT																													   5
#define CMP_MCMPC_ZPD_MASK																													0x20
#define CMP_MCMPC_TWIN_SHIFT																												   6
#define CMP_MCMPC_TWIN_MASK																													0x40
#define CMP_MCMPC_AOUT_SHIFT																												   7
#define CMP_MCMPC_AOUT_MASK																													0x80


/* ----------------------------------------------------------- CMP Configuration Handlers ------------------------------------------------------------ */










/* ----------------------------------------------------------- CAN Configuration Handlers ------------------------------------------------------------ */

typedef struct {
	volatile uint16_t CGMCTRL;
	volatile uint8_t CGMCS;
	volatile uint8_t BL[3];
	volatile uint16_t CGMABT;
	volatile uint8_t CGMABTD;
}CAN_GLBL_CTRL_Type, *CAN_GLBL_CTRL_MemMapPtr;


#define CAN0_GLOBAL_CTRL_REGISTER_BASE																								   	(0x05C0)
#define CAN0_GLBL_CTRL															   ((__near CAN_GLBL_CTRL_Type *)CAN0_GLOBAL_CTRL_REGISTER_BASE)

#define CAN1_GLOBAL_CTRL_REGISTER_BASE																								   	(0x0340)
#define CAN1_GLBL_CTRL															   ((__near CAN_GLBL_CTRL_Type *)CAN1_GLOBAL_CTRL_REGISTER_BASE)


/* CGMCTRL Bit Fields */
#define CAN_CGMCTRL_READ_GOM_SHIFT																											   0
#define CAN_CGMCTRL_READ_GOM_MASK																										  0x0001
#define CAN_CGMCTRL_READ_EFSD_SHIFT																											   1
#define CAN_CGMCTRL_READ_EFSD_MASK																										  0x0002
#define CAN_CGMCTRL_SET_GOM_SHIFT																											   8
#define CAN_CGMCTRL_SET_GOM_MASK																										  0x0100
#define CAN_CGMCTRL_SET_EFSD_SHIFT																											   9
#define CAN_CGMCTRL_SET_EFSD_MASK																										  0x0200
#define CAN_CGMCTRL_READ_MBON_SHIFT																											  15
#define CAN_CGMCTRL_READ_MBON_MASK																										  0x8000


/* CGMCS Bit Fields */
#define CAN_CGMCS_CCP_SHIFT																													   0
#define CAN_CGMCS_CCP_MASK																													0x0F
#define CAN_CGMCS_CCP_VALUE(x)											   (((uint8_t)(((uint8_t)(x))<<CAN_CGMCS_CCP_SHIFT))&CAN_CGMCS_CCP_MASK)


/* CGMABT Bit Fields */
#define CAN_CGMABT_READ_ABTTRG_SHIFT																										   0
#define CAN_CGMABT_READ_ABTTRG_MASK																										  0x0001
#define CAN_CGMABT_READ_ABTCLR_SHIFT																										   1
#define CAN_CGMABT_READ_ABTCLR_MASK																										  0x0002
#define CAN_CGMABT_SET_ABTTRG_SHIFT																											   8
#define CAN_CGMABT_SET_ABTTRG_MASK																										  0x0100
#define CAN_CGMABT_SET_ABTCLR_SHIFT																											   9
#define CAN_CGMABT_SET_ABTCLR_MASK																										  0x0200


/* CGMABTD Bit Fields */
#define CAN_CGMABTD_ABTD_SHIFT																												   0
#define CAN_CGMABTD_ABTD_MASK																												0x0F
#define CAN_CGMABTD_ABTD_VALUE(x)									 (((uint8_t)(((uint8_t)(x))<<CAN_CGMABTD_ABTD_SHIFT))&CAN_CGMABTD_ABTD_MASK)





