Alark8/RL78_Framework/inc/rl78_d1a_head.h
typedef struct {
	volatile uint16_t CMASK1L;
	volatile uint16_t CMASK1H;
	volatile uint16_t CMASK2L;
	volatile uint16_t CMASK2H;
	volatile uint16_t CMASK3L;
	volatile uint16_t CMASK3H;
	volatile uint16_t CMASK4L;
	volatile uint16_t CMASK4H;
}CAN_MASK_Type, *CAN_MASK_MemMapPtr;


#define CAN0_MASK_REGISTER_BASE																										   	(0x05D0)
#define CAN0_MASK																			   ((__near CAN_MASK_Type *)CAN0_MASK_REGISTER_BASE)

#define CAN1_MASK_REGISTER_BASE																										   	(0x0380)
#define CAN1_MASK																			   ((__near CAN_MASK_Type *)CAN1_MASK_REGISTER_BASE)





typedef struct {
	volatile uint16_t CCTRL;
	volatile uint8_t CLEC;
	volatile uint8_t CINFO;
	volatile uint16_t CERC;
	volatile uint16_t CIE;
	volatile uint16_t CINTS;
	volatile uint16_t CBRP;
	volatile uint16_t CBTR;
	volatile uint16_t CLIPT;
	volatile uint16_t CRGPT;
	volatile uint16_t CLOPT;
	volatile uint16_t CTGPT;
	volatile uint16_t CTS;
}CAN_INFO_Type, *CAN_INFO_MemMapPtr;


#define CAN0_INFO_REGISTER_BASE																										   	(0x05E0)
#define CAN0_INFO																			   ((__near CAN_INFO_Type *)CAN1_INFO_REGISTER_BASE)

#define CAN1_INFO_REGISTER_BASE																										   	(0x0390)
#define CAN1_INFO																			   ((__near CAN_INFO_Type *)CAN1_INFO_REGISTER_BASE)


/* CCTRL Bit Fields */
#define CAN_CCTRL_READ_OPMODE_SHIFT																											   0
#define CAN_CCTRL_READ_OPMODE_MASK																										  0x0007
#define CAN_CCTRL_READ_OPMODE_VALUE(x)					 (((uint16_t)(((uint16_t)(x))<<CAN_CCTRL_READ_OPMODE_SHIFT))&CAN_CCTRL_READ_OPMODE_MASK)
#define CAN_CCTRL_READ_PSMODE_SHIFT																											   3
#define CAN_CCTRL_READ_PSMODE_MASK																										  0x0018
#define CAN_CCTRL_READ_PSMODE_VALUE(x)					 (((uint16_t)(((uint16_t)(x))<<CAN_CCTRL_READ_PSMODE_SHIFT))&CAN_CCTRL_READ_PSMODE_MASK)
#define CAN_CCTRL_READ_VALID_SHIFT																											   5
#define CAN_CCTRL_READ_VALID_MASK																										  0x0020
#define CAN_CCTRL_READ_AL_SHIFT																												   6
#define CAN_CCTRL_READ_AL_MASK																											  0x0040
#define CAN_CCTRL_READ_CCERC_SHIFT																											   7
#define CAN_CCTRL_READ_CCERC_MASK																										  0x0080
#define CAN_CCTRL_READ_TSTAT_SHIFT																											   8
#define CAN_CCTRL_READ_TSTAT_MASK																										  0x0100
#define CAN_CCTRL_READ_RSTAT_SHIFT																											   9
#define CAN_CCTRL_READ_RSTAT_MASK																										  0x0200
#define CAN_CCTRL_SET_OPMODE_SHIFT																											   8
#define CAN_CCTRL_SET_OPMODE_MASK																										  0x0700
#define CAN_CCTRL_SET_OPMODE_VALUE(x)					   (((uint16_t)(((uint16_t)(x))<<CAN_CCTRL_SET_OPMODE_SHIFT))&CAN_CCTRL_SET_OPMODE_MASK)
#define CAN_CCTRL_SET_PSMODE_SHIFT																											  11
#define CAN_CCTRL_SET_PSMODE_MASK																										  0x1800
#define CAN_CCTRL_SET_PSMODE_VALUE(x)					   (((uint16_t)(((uint16_t)(x))<<CAN_CCTRL_SET_PSMODE_SHIFT))&CAN_CCTRL_SET_PSMODE_MASK)
#define CAN_CCTRL_SET_AL_SHIFT																												  14
#define CAN_CCTRL_SET_AL_MASK																											  0x4000
#define CAN_CCTRL_SET_CCERC_SHIFT																											  15
#define CAN_CCTRL_SET_CCERC_MASK																										  0x8000


/* CLEC Bit Fields */
#define CAN_CLEC_READ_LEC_SHIFT																												   0
#define CAN_CLEC_READ_LEC_MASK																												0x07
#define CAN_CLEC_READ_LEC_VALUE(x)								   (((uint8_t)(((uint8_t)(x))<<CAN_CLEC_READ_LEC_SHIFT))&CAN_CLEC_READ_LEC_MASK)


/* CINFO Bit Fields */
#define CAN_CINFO_RECS_SHIFT																												   0
#define CAN_CINFO_RECS_MASK																													0x03
#define CAN_CINFO_RECS_VALUE(x)											 (((uint8_t)(((uint8_t)(x))<<CAN_CINFO_RECS_SHIFT))&CAN_CINFO_RECS_MASK)
#define CAN_CINFO_TECS_SHIFT																												   2
#define CAN_CINFO_TECS_MASK																													0x0C
#define CAN_CINFO_TECS_VALUE(x)											 (((uint8_t)(((uint8_t)(x))<<CAN_CINFO_TECS_SHIFT))&CAN_CINFO_TECS_MASK)
#define CAN_CINFO_BOFF_SHIFT																												   4
#define CAN_CINFO_BOFF_MASK																													0x10


/* CERC Bit Fields */
#define CAN_CERC_TEC_SHIFT																													   0
#define CAN_CERC_TEC_MASK																												  0x00FF
#define CAN_CERC_TEC_VALUE(x)											   (((uint16_t)(((uint16_t)(x))<<CAN_CERC_TEC_SHIFT))&CAN_CERC_TEC_MASK)
#define CAN_CERC_REC_SHIFT																													   8
#define CAN_CERC_REC_MASK																												  0x7F00
#define CAN_CERC_REC_VALUE(x)											   (((uint16_t)(((uint16_t)(x))<<CAN_CERC_REC_SHIFT))&CAN_CERC_REC_MASK)
#define CAN_CERC_REPS_SHIFT																													  15
#define CAN_CERC_REPS_MASK																												  0x8000


/* CIE Bit Fields */
#define CAN_CIE_READ_CIE_SHIFT																												   0
#define CAN_CIE_READ_CIE_MASK																											  0x003F
#define CAN_CIE_READ_CIE_VALUE(x)								   (((uint16_t)(((uint16_t)(x))<<CAN_CIE_READ_CIE_SHIFT))&CAN_CIE_READ_CIE_MASK)
#define CAN_CIE_SET_CIE_SHIFT																												   8
#define CAN_CIE_SET_CIE_MASK																											  0x3F00
#define CAN_CIE_SET_CIE_VALUE(x)									 (((uint16_t)(((uint16_t)(x))<<CAN_CIE_SET_CIE_SHIFT))&CAN_CIE_SET_CIE_MASK)


/* CINTS Bit Fields */
#define CAN_CINTS_READ_CINTS_SHIFT																											   0
#define CAN_CINTS_READ_CINTS_MASK																										  0x003F
#define CAN_CINTS_READ_CINTS_VALUE(x)					   (((uint16_t)(((uint16_t)(x))<<CAN_CINTS_READ_CINTS_SHIFT))&CAN_CINTS_READ_CINTS_MASK)


/* CBRP Bit Fields */
#define CAN_CBRP_TQPRS_SHIFT																												   0
#define CAN_CBRP_TQPRS_MASK																												  0x00FF
#define CAN_CBRP_TQPRS_VALUE(x)										   (((uint16_t)(((uint16_t)(x))<<CAN_CBRP_TQPRS_SHIFT))&CAN_CBRP_TQPRS_MASK)


/* CBTR Bit Fields */
#define CAN_CBTR_TSEG1_SHIFT																												   0
#define CAN_CBTR_TSEG1_MASK																												  0x000F
#define CAN_CBTR_TSEG1_VALUE(x)										   (((uint16_t)(((uint16_t)(x))<<CAN_CBTR_TSEG1_SHIFT))&CAN_CBTR_TSEG1_MASK)
#define CAN_CBTR_TSEG2_SHIFT																												   8
#define CAN_CBTR_TSEG2_MASK																												  0x0700
#define CAN_CBTR_TSEG2_VALUE(x)										   (((uint16_t)(((uint16_t)(x))<<CAN_CBTR_TSEG2_SHIFT))&CAN_CBTR_TSEG2_MASK)
#define CAN_CBTR_SJW_SHIFT																													  12
#define CAN_CBTR_SJW_MASK																												  0x3000
#define CAN_CBTR_SJW_VALUE(x)											   (((uint16_t)(((uint16_t)(x))<<CAN_CBTR_SJW_SHIFT))&CAN_CBTR_SJW_MASK)


