Alark8/RL78_Framework/inc/rl78_d1a_head.h
/* CLIPT Bit Fields */
#define CAN_CLIPT_LIPT_SHIFT																												   0
#define CAN_CLIPT_LIPT_MASK																												  0x00FF
#define CAN_CLIPT_LIPT_VALUE(x)										   (((uint16_t)(((uint16_t)(x))<<CAN_CLIPT_LIPT_SHIFT))&CAN_CLIPT_LIPT_MASK)


/* CRGPT Bit Fields */
#define CAN_CRGPT_READ_ROVF_SHIFT																											   0
#define CAN_CRGPT_READ_ROVF_MASK																										  0x0001
#define CAN_CRGPT_READ_RHPM_SHIFT																											   1
#define CAN_CRGPT_READ_RHPM_MASK																										  0x0002
#define CAN_CRGPT_READ_RGPT_SHIFT																											   8
#define CAN_CRGPT_READ_RGPT_MASK																										  0xFF00
#define CAN_CRGPT_READ_RGPT_VALUE(x)						 (((uint16_t)(((uint16_t)(x))<<CAN_CRGPT_READ_RGPT_SHIFT))&CAN_CRGPT_READ_RGPT_MASK)


/* CLOPT Bit Fields */
#define CAN_CLOPT_LOPT_SHIFT																												   0
#define CAN_CLOPT_LOPT_MASK																												  0x00FF
#define CAN_CLOPT_LOPT_VALUE(x)										   (((uint16_t)(((uint16_t)(x))<<CAN_CLOPT_LOPT_SHIFT))&CAN_CLOPT_LOPT_MASK)


/* CTGPT Bit Fields */
#define CAN_CTGPT_READ_TOVF_SHIFT																											   0
#define CAN_CTGPT_READ_TOVF_MASK																										  0x0001
#define CAN_CTGPT_READ_THPM_SHIFT																											   1
#define CAN_CTGPT_READ_THPM_MASK																										  0x0002
#define CAN_CTGPT_READ_TGPT_SHIFT																											   8
#define CAN_CTGPT_READ_TGPT_MASK																										  0xFF00
#define CAN_CTGPT_READ_TGPT_VALUE(x)						 (((uint16_t)(((uint16_t)(x))<<CAN_CTGPT_READ_TGPT_SHIFT))&CAN_CTGPT_READ_TGPT_MASK)


/* CTS Bit Fields */
#define CAN_CTS_READ_TSEN_SHIFT																												   0
#define CAN_CTS_READ_TSEN_MASK																											  0x0001
#define CAN_CTS_READ_TSSEL_SHIFT																											   1
#define CAN_CTS_READ_TSSEL_MASK																											  0x0002
#define CAN_CTS_READ_TSLOCK_SHIFT																											   2
#define CAN_CTS_READ_TSLOCK_MASK																										  0x0004
#define CAN_CTS_SET_TSEN_SHIFT																												   8
#define CAN_CTS_SET_TSEN_MASK																											  0x0100
#define CAN_CTS_SET_TSSEL_SHIFT																												   9
#define CAN_CTS_SET_TSSEL_MASK																											  0x0200
#define CAN_CTS_SET_TSLOCK_SHIFT																											  10
#define CAN_CTS_SET_TSLOCK_MASK																											  0x0400







typedef struct {
	volatile uint8_t CMDB0;
	volatile uint8_t CMDB1;
	volatile uint8_t CMDB2;
	volatile uint8_t CMDB3;
	volatile uint8_t CMDB4;
	volatile uint8_t CMDB5;
	volatile uint8_t CMDB6;
	volatile uint8_t CMDB7;
	volatile uint8_t CMDLC;
	volatile uint8_t CMCONF;
	volatile uint16_t CMIDL;
	volatile uint16_t CMIDH;
	volatile uint16_t CMCTRL;
}CAN_MSG_Type, *CAN_MSG_MemMapPtr;


#define CAN0_MESSAGE_DB_REGISTER_00_BASE																							    (0x0600)
#define CAN0_MSG_00																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_00_BASE)

#define CAN0_MESSAGE_DB_REGISTER_01_BASE																							    (0x0610)
#define CAN0_MSG_01																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_01_BASE)

#define CAN0_MESSAGE_DB_REGISTER_02_BASE																							    (0x0620)
#define CAN0_MSG_02																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_02_BASE)

#define CAN0_MESSAGE_DB_REGISTER_03_BASE																							    (0x0630)
#define CAN0_MSG_03																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_03_BASE)

#define CAN0_MESSAGE_DB_REGISTER_04_BASE																							    (0x0640)
#define CAN0_MSG_04																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_04_BASE)

#define CAN0_MESSAGE_DB_REGISTER_05_BASE																							    (0x0650)
#define CAN0_MSG_05																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_05_BASE)

#define CAN0_MESSAGE_DB_REGISTER_06_BASE																							    (0x0660)
#define CAN0_MSG_06																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_06_BASE)

#define CAN0_MESSAGE_DB_REGISTER_07_BASE																							    (0x0670)
#define CAN0_MSG_07																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_07_BASE)

#define CAN0_MESSAGE_DB_REGISTER_08_BASE																							    (0x0680)
#define CAN0_MSG_08																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_08_BASE)

#define CAN0_MESSAGE_DB_REGISTER_09_BASE																							    (0x0690)
#define CAN0_MSG_09																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_09_BASE)

#define CAN0_MESSAGE_DB_REGISTER_10_BASE																							    (0x06A0)
#define CAN0_MSG_10																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_10_BASE)

#define CAN0_MESSAGE_DB_REGISTER_11_BASE																							    (0x06B0)
#define CAN0_MSG_11																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_11_BASE)

#define CAN0_MESSAGE_DB_REGISTER_12_BASE																							    (0x06C0)
#define CAN0_MSG_12																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_12_BASE)

#define CAN0_MESSAGE_DB_REGISTER_13_BASE																							    (0x06D0)
#define CAN0_MSG_13																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_13_BASE)

#define CAN0_MESSAGE_DB_REGISTER_14_BASE																							    (0x06E0)
#define CAN0_MSG_14																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_14_BASE)

#define CAN0_MESSAGE_DB_REGISTER_15_BASE																							    (0x06F0)
#define CAN0_MSG_15																	   ((__near CAN_MSG_Type *)CAN0_MESSAGE_DB_REGISTER_15_BASE)

#define CAN1_MESSAGE_DB_REGISTER_00_BASE																							    (0x0400)
#define CAN1_MSG_00																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_00_BASE)

#define CAN1_MESSAGE_DB_REGISTER_01_BASE																							    (0x0410)
#define CAN1_MSG_01																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_01_BASE)

#define CAN1_MESSAGE_DB_REGISTER_02_BASE																							    (0x0420)
#define CAN1_MSG_02																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_02_BASE)

#define CAN1_MESSAGE_DB_REGISTER_03_BASE																							    (0x0430)
#define CAN1_MSG_03																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_03_BASE)

#define CAN1_MESSAGE_DB_REGISTER_04_BASE																							    (0x0440)
#define CAN1_MSG_04																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_04_BASE)

#define CAN1_MESSAGE_DB_REGISTER_05_BASE																							    (0x0450)
#define CAN1_MSG_05																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_05_BASE)

#define CAN1_MESSAGE_DB_REGISTER_06_BASE																							    (0x0460)
#define CAN1_MSG_06																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_06_BASE)

