Alark8/RL78_Framework/inc/rl78_d1a_head.h
#define CAN1_MESSAGE_DB_REGISTER_07_BASE																							    (0x0470)
#define CAN1_MSG_07																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_07_BASE)

#define CAN1_MESSAGE_DB_REGISTER_08_BASE																							    (0x0480)
#define CAN1_MSG_08																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_08_BASE)

#define CAN1_MESSAGE_DB_REGISTER_09_BASE																							    (0x0490)
#define CAN1_MSG_09																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_09_BASE)

#define CAN1_MESSAGE_DB_REGISTER_10_BASE																							    (0x04A0)
#define CAN1_MSG_10																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_10_BASE)

#define CAN1_MESSAGE_DB_REGISTER_11_BASE																							    (0x04B0)
#define CAN1_MSG_11																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_11_BASE)

#define CAN1_MESSAGE_DB_REGISTER_12_BASE																							    (0x04C0)
#define CAN1_MSG_12																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_12_BASE)

#define CAN1_MESSAGE_DB_REGISTER_13_BASE																							    (0x04D0)
#define CAN1_MSG_13																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_13_BASE)

#define CAN1_MESSAGE_DB_REGISTER_14_BASE																							    (0x04E0)
#define CAN1_MSG_14																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_14_BASE)

#define CAN1_MESSAGE_DB_REGISTER_15_BASE																							    (0x04F0)
#define CAN1_MSG_15																	   ((__near CAN_MSG_Type *)CAN1_MESSAGE_DB_REGISTER_15_BASE)



/* CMCONF Bit Fields */
#define CAN_CMCONF_MA_SHIFT																													   0
#define CAN_CMCONF_MA_MASK																													0x01
#define CAN_CMCONF_MT_SHIFT																													   3
#define CAN_CMCONF_MT_MASK																													0x38
#define CAN_CMCONF_MT_VALUE(x)											   (((uint8_t)(((uint8_t)(x))<<CAN_CMCONF_MT_SHIFT))&CAN_CMCONF_MT_MASK)
#define CAN_CMCONF_RTR_SHIFT																												   6
#define CAN_CMCONF_RTR_MASK																													0x40
#define CAN_CMCONF_OWS_SHIFT																												   7
#define CAN_CMCONF_OWS_MASK																													0x80


/* CMCTRL Bit Fields */
#define CAN_CMCTRL_READ_RDY_SHIFT																											   0
#define CAN_CMCTRL_READ_RDY_MASK																										  0x0001
#define CAN_CMCTRL_READ_TRQ_SHIFT																											   1
#define CAN_CMCTRL_READ_TRQ_MASK																										  0x0002
#define CAN_CMCTRL_READ_DN_SHIFT																											   2
#define CAN_CMCTRL_READ_DN_MASK																											  0x0004
#define CAN_CMCTRL_READ_IE_SHIFT																											   3
#define CAN_CMCTRL_READ_IE_MASK																											  0x0008
#define CAN_CMCTRL_READ_MOW_SHIFT																											   4
#define CAN_CMCTRL_READ_MOW_MASK																										  0x0010
#define CAN_CMCTRL_SET_RDY_SHIFT																											   8
#define CAN_CMCTRL_SET_RDY_MASK																											  0x0100
#define CAN_CMCTRL_SET_TRQ_SHIFT																											   9
#define CAN_CMCTRL_SET_TRQ_MASK																											  0x0200
#define CAN_CMCTRL_SET_IE_SHIFT																												  11
#define CAN_CMCTRL_SET_IE_MASK																											  0x0800
#define CAN_CMCTRL_READ_MUC_SHIFT																											  13
#define CAN_CMCTRL_READ_MUC_MASK																										  0x2000


/* ----------------------------------------------------------- CAN Configuration Handlers ------------------------------------------------------------ */














/* ------------------------------------------------------------ Safety Function Registers ---------------------------------------------------------- */

#define CRC_INPUT_REGISTER_BASE												   														   	(0xFFAC)
#define CRCIN										     								   *((__near volatile uint8_t *)CRC_INPUT_REGISTER_BASE)

#define INVALID_MEM_ACCESS_DETECT_CTRL_REGISTER_BASE								  	   											   	(0x0078)
#define IAWCTL														  *((__near volatile uint8_t *)INVALID_MEM_ACCESS_DETECT_CTRL_REGISTER_BASE)

/* IAWCTL Bit Fields */
#define IAWCTL_GCSC_SHIFT																													   0
#define IAWCTL_GCSC_MASK																													0x01
#define IAWCTL_GINT_SHIFT																													   1
#define IAWCTL_GINT_MASK																													0x02
#define IAWCTL_GPORT_SHIFT																													   2
#define IAWCTL_GPORT_MASK																													0x04
#define IAWCTL_GRAM_SHIFT																													   4
#define IAWCTL_GRAM_MASK																													0x30
#define IAWCTL_GRAM_VALUE(x)												   (((uint8_t)(((uint8_t)(x))<<IAWCTL_GRAM_SHIFT))&IAWCTL_GRAM_MASK)
#define IAWCTL_IAWEN_SHIFT																													   7
#define IAWCTL_IAWEN_MASK																													0x80





#define RAM_PARITY_ERROR_CTRL_REGISTER_BASE										   													   	(0x00F5)
#define RPECTL											 					   *((__near volatile uint8_t *)RAM_PARITY_ERROR_CTRL_REGISTER_BASE)

/* RPECTL Bit Fields */
#define RPECTL_RPEF_SHIFT																													   0
#define RPECTL_RPEF_MASK																													0x01
#define RPECTL_RPERDIS_SHIFT																												   7
#define RPECTL_RPERDIS_MASK																													0x80




#define FMP_CLOCK_DIVISION_SEL_REGISTER_BASE																						   	(0x00F8)
#define MDIV																  *((__near volatile uint8_t *)FMP_CLOCK_DIVISION_SEL_REGISTER_BASE)

/* MDIV Bit Fields */
#define CLOCK_MDIV_SHIFT																													   0
#define CLOCK_MDIV_MASK																														0x07
#define CLOCK_MDIV_VALUE(x)														 (((uint8_t)(((uint8_t)(x))<<CLOCK_MDIV_SHIFT))&CLOCK_MDIV_MASK)





#define FLASH_MEM_CRC_CTRL_REGISTER_BASE										   													   	(0x02F0)
#define CRC0CTL										    						  *((__near volatile uint8_t *)FLASH_MEM_CRC_CTRL_REGISTER_BASE)

/* CRC0CTL Bit Fields */
#define CRC0CTL_FEA_SHIFT																													   0
#define CRC0CTL_FEA_MASK																													0x3F
#define CRC0CTL_FEA_VALUE(x)												   (((uint8_t)(((uint8_t)(x))<<CRC0CTL_FEA_SHIFT))&CRC0CTL_FEA_MASK)
#define CRC0CTL_CRC0EN_SHIFT																												   7
#define CRC0CTL_CRC0EN_MASK																													0x80






#define FLASH_MEM_CRC_OPER_RESULT_REGISTER_BASE										   												   	(0x02F2)
#define PGCRCL										    				  *((__near volatile uint16_t *)FLASH_MEM_CRC_OPER_RESULT_REGISTER_BASE)

