Alark8/RL78_Framework/inc/rl78_d1a_head.h
#define CRC_DATA_REGISTER_BASE												   														   	(0x02FA)
#define CRCD										     								   *((__near volatile uint16_t *)CRC_DATA_REGISTER_BASE)






#define STEPPER_MOTOR_PORT_MODE_CTRL_REGISTER_BASE						 						   									   	(0xFF37)
#define SMPC							      							*((__near volatile uint8_t *)STEPPER_MOTOR_PORT_MODE_CTRL_REGISTER_BASE)

/* SMPC Bit Fields */
#define SMPC_EN_MASK																														0x0F
#define SMPC_EN_SHIFT																														   0
#define SMPC_EN_VALUE(x)															   (((uint8_t)(((uint8_t)(x))<<SMPC_EN_SHIFT))&SMPC_EN_MASK)
#define SMPC_MOD_MASK																														0xF0
#define SMPC_MOD_SHIFT																														   4
#define SMPC_MOD_VALUE(x)															 (((uint8_t)(((uint8_t)(x))<<SMPC_MOD_SHIFT))&SMPC_MOD_MASK)




#define RESET_CTRL_FLAG_REGISTER_BASE			 							   														   	(0xFFA8)
#define RESF										    							 *((__near volatile uint8_t *)RESET_CTRL_FLAG_REGISTER_BASE)

/* RESF Bit Fields */
#define RESF_LVIRF_SHIFT																													   0
#define RESF_LVIRF_MASK																														0x01
#define RESF_IAWRF_SHIFT																													   1
#define RESF_IAWRF_MASK																														0x02
#define RESF_RPERF_SHIFT																													   2
#define RESF_RPERF_MASK																														0x04
#define RESF_WDTRF_SHIFT																													   4
#define RESF_WDTRF_MASK																														0x10
#define RESF_TRAP_SHIFT																														   7
#define RESF_TRAP_MASK																														0x80



#define WATCHDOG_TIMER_ENABLE_REGISTER_BASE					 					   													   	(0xFFAB)
#define WDTE											 					   *((__near volatile uint8_t *)WATCHDOG_TIMER_ENABLE_REGISTER_BASE)

/* WDTE Bit Fields */
#define WDTE_WDSTBYON_SHIFT																													   0
#define WDTE_WDSTBYON_MASK																													0x01
#define WDTE_WDCS_SHIFT																														   1
#define WDTE_WDCS_MASK																														0x0E
#define WDTE_WDCS_VALUE(x)														   (((uint8_t)(((uint8_t)(x))<<WDTE_WDCS_SHIFT))&WDTE_WDCS_MASK)
#define WDTE_WDTON_SHIFT																													   4
#define WDTE_WDTON_MASK																														0x10
#define WDTE_WINDOW_SHIFT																													   5
#define WDTE_WINDOW_MASK																													0x60
#define WDTE_WINDOW_VALUE(x)												   (((uint8_t)(((uint8_t)(x))<<WDTE_WINDOW_SHIFT))&WDTE_WINDOW_MASK)
#define WDTE_WDTINT_SHIFT																													   7
#define WDTE_WDTINT_MASK																													0x80



#define PROCESSOR_MODE_CTRL_REGISTER_BASE																							   	(0xFFFE)
#define PMC																		 *((__near volatile uint8_t *)PROCESSOR_MODE_CTRL_REGISTER_BASE)

#define RESET_OUTPUT_CTRL_REGISTER_BASE																								   	(0x0014)
#define RESOC																	   *((__near volatile uint8_t *)RESET_OUTPUT_CTRL_REGISTER_BASE)




#define STOP_STATUS_OUTPUT_CTRL_REGISTER_BASE																						   	(0x0016)
#define STPSTC																 *((__near volatile uint8_t *)STOP_STATUS_OUTPUT_CTRL_REGISTER_BASE)

/* STPSTC Bit Fields */
#define STPSTC_STPLV_SHIFT																													   4
#define STPSTC_STPLV_MASK																													0x10
#define STPSTC_STPOEN_SHIFT																													   7
#define STPSTC_STPOEN_MASK																													0x80





#define DATA_FLASH_CTRL_REGISTER_BASE																								   	(0x0090)
#define DFLCTL																		 *((__near volatile uint8_t *)DATA_FLASH_CTRL_REGISTER_BASE)

/* DFLCTL Bit Fields */
#define DFLCTL_DFLEN_SHIFT																													   0
#define DFLCTL_DFLEN_MASK																													0x01






#define CLM_RESET_CTRL_FLAG_REGISTER_BASE																							   	(0x00FA)
#define RESFCLM																	 *((__near volatile uint8_t *)CLM_RESET_CTRL_FLAG_REGISTER_BASE)

/* REFCLM Bit Fields */
#define REFCLM_CLKRF_SHIFT																													   0
#define REFCLM_CLKRF_MASK																													0x01





#define POC_RESET_CONFIRM_REGISTER_BASE													  											   	(0x00FB)
#define POCRES																	   *((__near volatile uint8_t *)POC_RESET_CONFIRM_REGISTER_BASE)

/* POCRES Bit Fields */
#define POCRES_POCRES0_SHIFT																												   0
#define POCRES_POCRES0_MASK																													0x01




#define GUARD_REGISTER_BASE																											   	(0x00FC)
#define GUARD																				   *((__near volatile uint8_t *)GUARD_REGISTER_BASE)

/* GUARD Bit Fields */
#define GUARD_GDPLL_SHIFT																													   0
#define GUARD_GDPLL_MASK																													0x01
#define GUARD_GDRTC_SHIFT																													   1
#define GUARD_GDRTC_MASK																													0x02



#define OPTION_REGISTER_1_BASE																										   (0x000C0)
#define OPT1																					   *((volatile uint8_t *)OPTION_REGISTER_1_BASE)

/* OPT1 Bit Fields */
#define OPT1_WDSTBYON_SHIFT																													   0
#define OPT1_WDSTBYON_MASK																													0x01
#define OPT1_WDCS_SHIFT																														   1
#define OPT1_WDCS_MASK																														0x0E
#define OPT1_WDCS_VALUE(x)														   (((uint8_t)(((uint8_t)(x))<<OPT1_WDCS_SHIFT))&OPT1_WDCS_MASK)
#define OPT1_WDTON_SHIFT																													   4
#define OPT1_WDTON_MASK																														0x10
#define OPT1_WINDOW_SHIFT																													   5
#define OPT1_WINDOW_MASK																													0x60
#define OPT1_WINDOW_VALUE(x)												   (((uint8_t)(((uint8_t)(x))<<OPT1_WINDOW_SHIFT))&OPT1_WINDOW_MASK)
#define OPT1_WDTINT_SHIFT																													   7
#define OPT1_WDTINT_MASK																													0x80




#define OPTION_REGISTER_2_BASE																										   (0x000C1)
#define OPT2																					   *((volatile uint8_t *)OPTION_REGISTER_2_BASE)

/* OPT2 Bit Fields */
#define OPT2_LVIMDS_SHIFT																													   0
#define OPT2_LVIMDS_MASK																													0x03
#define OPT2_LVIMDS_VALUE(x)												   (((uint8_t)(((uint8_t)(x))<<OPT2_LVIMDS_SHIFT))&OPT2_LVIMDS_MASK)
#define OPT2_LVIS_SHIFT																														   2
#define OPT2_LVIS_MASK																														0x0C
#define OPT2_LVIS_VALUE(x)														   (((uint8_t)(((uint8_t)(x))<<OPT2_LVIS_SHIFT))&OPT2_LVIS_MASK)
#define OPT2_CLKMB_SHIFT																													   4
#define OPT2_CLKMB_MASK																														0x10
#define OPT2_VPOC_SHIFT																														   5
#define OPT2_VPOC_MASK																														0xE0
#define OPT2_VPOC_VALUE(x)														   (((uint8_t)(((uint8_t)(x))<<OPT2_VPOC_SHIFT))&OPT2_VPOC_MASK)




#define OPTION_REGISTER_3_BASE																										   (0x000C2)
#define OPT3																					   *((volatile uint8_t *)OPTION_REGISTER_3_BASE)

/* OPT3 Bit Fields */
#define OPT3_FRQSEL_SHIFT																													   0
#define OPT3_FRQSEL_MASK																													0x0F
#define OPT3_FRQSEL_VALUE(x)												   (((uint8_t)(((uint8_t)(x))<<OPT3_FRQSEL_SHIFT))&OPT3_FRQSEL_MASK)
#define OPT3_OPTPLL_SHIFT																													   5
#define OPT3_OPTPLL_MASK																													0x20
#define OPT3_CMODE_SHIFT																													   6
#define OPT3_CMODE_MASK																														0xC0
#define OPT3_CMODE_VALUE(x)														 (((uint8_t)(((uint8_t)(x))<<OPT3_CMODE_SHIFT))&OPT3_CMODE_MASK)




#define OPTION_REGISTER_4_BASE																										   (0x000C3)
#define OPT4																					   *((volatile uint8_t *)OPTION_REGISTER_4_BASE)

