Alark8/RL78_Framework/inc/rl78_d1a_head.h
/* OPT4 Bit Fields */
#define OPT4_OCDERSD_SHIFT																													   0
#define OPT4_OCDERSD_MASK																													0x01
#define OPT4_OCDENSET_SHIFT																													   7
#define OPT4_OCDENSET_MASK																													0x80


/* ------------------------------------------------------------ Safety Function Registers ---------------------------------------------------------- */




#define WATCHDOG_VECTOR_ADDRESS                         							  0x0004
#define VOLTAGE_DETECT_VECTOR_ADDRESS      											  0x0006
#define EXT_INTERRUPT0_VECTOR_ADDRESS  												  0x0008
#define EXT_INTERRUPT1_VECTOR_ADDRESS   											  0x000A
#define EXT_INTERRUPT2_VECTOR_ADDRESS   											  0x000C
#define EXT_INTERRUPT3_VECTOR_ADDRESS   											  0x000E
#define EXT_INTERRUPT4_VECTOR_ADDRESS   											  0x0010
#define EXT_INTERRUPT5_VECTOR_ADDRESS   											  0x0012
#define CLOCK_INTERRUPT_VECTOR_ADDRESS   											  0x0014
#define UART0_TX_VECTOR_ADDRESS			   											  0x0016
#define UART0_RX_VECTOR_ADDRESS			   											  0x0018
#define DMA0_TX_VECTOR_ADDRESS			   											  0x001A
#define DMA1_TX_VECTOR_ADDRESS			   											  0x001C
#define RTC_ALARM_VECTOR_ADDRESS		   											  0x001E
#define INTERVAL_TIMER_VECTOR_ADDRESS   											  0x0020
#define LIN_UART0_TX_VECTOR_ADDRESS		   											  0x0022
#define LIN_UART0_RX_VECTOR_ADDRESS	    											  0x0024
#define LIN_UART0_RX_STATUS_VECTOR_ADDRESS 											  0x0026
#define LIN_UART0_RX_PIN_IP_VECTOR_ADDRESS	  										  0x0028
#define SG_ALD_VECTOR_ADDRESS			   											  0x002A
#define TAU0_CHANNEL0_VECTOR_ADDRESS    											  0x002C
#define TAU0_CHANNEL1_VECTOR_ADDRESS    											  0x002E
#define TAU0_CHANNEL2_VECTOR_ADDRESS    											  0x0030
#define TAU0_CHANNEL3_VECTOR_ADDRESS    											  0x0032
#define ADC_CONVERSION_VECTOR_ADDRESS												  0x0034
#define LIN_UART1_TX_VECTOR_ADDRESS     											  0x0036
#define LIN_UART1_RX_VECTOR_ADDRESS     											  0x0038
#define LIN_UART1_RX_STATUS_VECTOR_ADDRESS											  0x003A
#define LIN_UART1_RX_PIN_IP_VECTOR_ADDRESS											  0x003C
#define CSI10_COMM_VECTOR_ADDRESS		   											  0x003E
#define IIC11_COMM_VECTOR_ADDRESS       											  0x0040
#define TAU0_CHANNEL4_VECTOR_ADDRESS    											  0x0042
#define TAU0_CHANNEL5_VECTOR_ADDRESS    											  0x0044
#define TAU0_CHANNEL6_VECTOR_ADDRESS    											  0x0046
#define TAU0_CHANNEL7_VECTOR_ADDRESS    											  0x0048
#define CAN1_ERROR_VECTOR_ADDRESS	    											  0x004A
#define CAN1_WAKEUP_VECTOR_ADDRESS       											  0x004C
#define CAN0_ERROR_VECTOR_ADDRESS                        							  0x004E
#define CAN0_WAKEUP_VECTOR_ADDRESS      											  0x0050
#define CAN0_RX_VECTOR_ADDRESS      												  0x0052
#define CAN0_TX_VECTOR_ADDRESS          											  0x0054
#define TAU1_CHANNEL0_VECTOR_ADDRESS     											  0x0056
#define TAU1_CHANNEL1_VECTOR_ADDRESS    											  0x0058
#define TAU1_CHANNEL2_VECTOR_ADDRESS    											  0x005A
#define TAU1_CHANNEL3_VECTOR_ADDRESS    											  0x005C
#define END_OF_DIV_VECTOR_ADDRESS     												  0x005E
#define CAN1_RX_VECTOR_ADDRESS          											  0x0060
#define END_OF_SEQ_VECTOR_ADDRESS       											  0x0062
#define CAN1_TX_VECTOR_ADDRESS          											  0x0064
#define TAU1_CHANNEL4_VECTOR_ADDRESS    											  0x0066
#define TAU1_CHANNEL5_VECTOR_ADDRESS    											  0x0068
#define TAU1_CHANNEL6_VECTOR_ADDRESS    											  0x006A
#define TAU1_CHANNEL7_VECTOR_ADDRESS    											  0x006C
#define TAU2_CHANNEL0_VECTOR_ADDRESS    											  0x006E
#define TAU2_CHANNEL1_VECTOR_ADDRESS    											  0x0070
#define TAU2_CHANNEL2_VECTOR_ADDRESS    											  0x0072
#define TAU2_CHANNEL3_VECTOR_ADDRESS    											  0x0074
#define TAU2_CHANNEL4_VECTOR_ADDRESS    											  0x0076
#define TAU2_CHANNEL6_VECTOR_ADDRESS    											  0x0078
#define DMA2_TX_VECTOR_ADDRESS                         								  0x007A
#define DMA3_TX_VECTOR_ADDRESS          											  0x007C


#endif
